{
	"social.key.discord": "PFLINK<Discord><{{{url}}}>",
	"social.key.telegram": "PFLINK<Telegram><{{{url}}}>",
	"social.key.twitter": "PFLINK<Twitter><{{{url}}}>",
	"social.key.discord.withname": "PFLINK<{{{name}}} Discord><{{{url}}}>",
	"social.key.telegram.withname": "PFLINK<{{{name}}} Telegram><{{{url}}}>",
	"social.key.twitter.withname": "PFLINK<{{{name}}} Twitter><{{{url}}}>",
	"social.key.website.withname": "PFLINK<{{{name}}} Website><{{{url}}}>",
	"obtain.pool.twotoken": "Deposit {{token1}} and {{token2}} at a 50-50 rate in {{protocol}}'s PFLINK<{{token1}}/{{token2}}><{{{link}}}> pool.",
	"obtain.pool.multitoken": "Deposit any of {{{tokens}}} into {{protocol}}'s PFLINK<{{poolName}}><{{{link}}}> pool.",
	"obtain.pool.multitoken.all": "Deposit all of {{tokens}} into {{protocol}}'s PFLINK<{{poolName}}><{{{link}}}> pool.",
	"obtain.pool.onetoken": "Deposit {{token}} in {{protocol}}'s PFLINK<{{poolName}}><{{{link}}}> pool.",
	"obtain.pool.onetoken.jar": "Deposit {{token}} into this asset directly.",
	"obtain.pool.zapper": "Zap using Zapper's PFLINK<{{{poolName}}}><{{{poolUrl}}}> pool.",
	"obtain.pool.uni3": "Deposit {{token1}} and {{token2}} into the pickle jar directly.",
	"risk.smart.contract": "Smart contract issues with {{protocol}}.",
	"risk.chain": "Problems with the {{chain}} network.",
	"risk.maintain.peg": "{{token}} may fail to maintain it's peg to {{target}}.",
	"risk.divergence.loss": "Divergence / Impermanent Loss: large swings in token prices may cause this strategy to underperform holding the underlying tokens.",
	"asset.description.standard.lp": "A {{protocol}} strategy for PFLINK<{{{tokens}}}><{{{poolUrl}}}>, a liquidity pool composed of {{{tokens}}} tokens. The deposit token is staked in {{{stakeLocation}}} for {{{rewards}}} rewards. All rewards are sold to purchase more LP tokens.",
	"asset.description.univ3.lp": "A Uniswap-V3 strategy for PFLINK<{{{tokens}}}><{{{poolUrl}}}>, a Uniswap-v3 style liquidity pool composed of {{{tokens}}} tokens. Using concentrated ranges, this style of strategies can capture more LP trading fees than other types of liquidity pools.",
	"asset.description.univ3.rewards.lp": "A Uniswap-V3 strategy for PFLINK<{{{tokens}}}><{{{poolUrl}}}>, a Uniswap-v3 style liquidity pool composed of {{{tokens}}} tokens. Using concentrated ranges, this style of strategies can capture more LP trading fees than other types of liquidity pools. The deposit token is staked in {{{stakeLocation}}} for {{{rewards}}} rewards. All rewards are sold to purchase more LP tokens.",
	"asset.description.balancer.rewards.lp": "A {{protocol}} strategy for PFLINK<{{{tokens}}}><{{{poolUrl}}}>, a Balancer-style liquidity pool composed of {{{tokens}}} tokens. The receipt token is staked in {{{stakeLocation}}} for {{{rewards}}} rewards. All rewards are sold to purchase more LP tokens.",
	"asset.description.curve.rewards.lp": "A {{protocol}} strategy for PFLINK<{{{tokens}}}><{{{poolUrl}}}>, a Curve-style liquidity pool composed of {{{tokens}}} tokens. The receipt token is staked in {{{stakeLocation}}} for {{{rewards}}} rewards. All rewards are sold to purchase more LP tokens.",
	"asset.description.single.staking": "A {{protocol}} strategy for PFLINK<{{{tokens}}}><{{{poolUrl}}}>, a single-token farming protocol. A user deposits {{{tokens}}} tokens. The receipt token is staked in {{{stakeLocation}}} for {{{rewards}}} rewards. All rewards are sold for more deposit token and reinvested in the pool.",
	"custom.sCRV.desc": "A Curve strategy for PFLINK<sUSDv2 pool><https://www.curve.fi/susdv2/deposit> sUSDv2 pool employs a basket of 4 stablecoins to peg to US$1 and the switching between them to be stable at $1, learn more about PFLINK<sUSD><https://docs.synthetix.io/litepaper>. CRV reward is reinvested for more LP.",
	"custom.renBTCCRV.desc": "A Curve strategy for PFLINK<renBTC pool><https://www.curve.fi/ren/deposit> renBTC pool employs a basket of renBTC and WBTC to peg to 1BTC. Learn more about PFLINK<renVM><https://github.com/renproject/ren/wiki#tldr> and PFLINK<WBTC><https://wbtc.network>. CRV reward is reinvested for more LP.",
	"custom.3poolCRV.desc": "A Curve strategy for PFLINK<3poolCRV pool><https://www.curve.fi/3pool/deposit> 3poolCRV pool employs the 3 most popular stablecoins to peg to US$1 and the switching between them to be stable at $1, learn more about PFLINK<DAI><https://makerdao.com/en/>, PFLINK<USDC><https://www.circle.com/en/usdc>, and PFLINK<USDT><https://tether.to>. CRV reward is reinvested for more LP.",
	"custom.steCRV.desc": "A Convex strategy for PFLINK<stETH pool><https://www.curve.fi/steth/deposit> stETH pool aims to peg the staked ETH in LIDO to 1 ETH and making stETH liquid. Learn more about PFLINK<LIDO><https://www.lido.fi>. CVX, LIDO and CRV reward is reinvested for more LP.",
	"custom.ALETH.desc": "A Saddle strategy for PFLINK<alETH pool><https://saddle.exchange/#/pools/aleth/deposit> alETH pool aims to peg alETH from Alchemix to peg to 1 ETH and making alETH liquid. Learn more about alETH>. This symbiotic jar reinvests the ALCX reward and stake it in the ALCX single pool.",
	"custom.LQTY.desc": "A Liquity strategy for LQTY staking. LQTY is a token that captures the fee revenue generated by the Liquity Protocol via staking. You can read more about LQTY and Liquity PFLINK<here><https://docs.liquity.org>.",
	"custom.MIR-UST.desc": "A Uniswap V2 strategy for PFLINK<UST/MIR><https://app.uniswap.org/#/add/v2/0x09a3ecafa817268f77be1283176b946c4ff2e608/0xa47c8bf37f92aBed4A126BDA807A7b7498661acD> an Uniswap V2 of UST/MIR. UST is the stablecoin in PFLINK<Terra network><https://terra.money/#1> while PFLINK<MIR><https://docs.mirror.finance/protocol/mirror-token-mir> is the governance token of Mirror protocol.> MIR reward is reinvested for more LP.",
	"custom.MTSLA-UST.desc": "A Mirrored TSLA (mAsset) strategy for PFLINK<UST/MTSLA><https://app.uniswap.org/#/add/v2/0x21cA39943E91d704678F5D00b6616650F066fD63/0xa47c8bf37f92aBed4A126BDA807A7b7498661acD> an Uniswap V2 LP of UST:MTSLA>. MTSLA is a mirrored PFLINK<Tesla Inc. Common Stock><https://www.nasdaq.com/market-activity/stocks/tsla>, using decentralized oracles from Band protocol, which updates every 15 seconds on the Band chain. Read more PFLINK<here><https://medium.com/mirror-protocol/mirror-protocol-partners-with-band-protocol-to-secure-issuance-of-synthetic-stocks-and-etfs-1a12181b6cdc>. MIR reward is reinvested for more LP.",
	"custom.MAAPL-UST.desc": "A Mirrored APPL (mAsset) strategy for PFLINK<UST/MAAPL><https://app.uniswap.org/#/add/v2/0xd36932143F6eBDEDD872D5Fb0651f4B72Fd15a84/0xa47c8bf37f92aBed4A126BDA807A7b7498661acD> an Uniswap V2 LP of UST:MAAPL>. MAAPL is a mirrored PFLINK<Apple Inc. Common Stock><https://www.nasdaq.com/market-activity/stocks/aapl>. MIR reward is reinvested for more LP.",
	"custom.MQQQ-UST.desc": "A Mirrored QQQ (mAsset) strategy for PFLINK<UST/MQQQ><https://app.uniswap.org/#/add/v2/0x13B02c8dE71680e71F0820c996E4bE43c2F57d15/0xa47c8bf37f92aBed4A126BDA807A7b7498661acD> an Uniswap V2 LP of UST:MQQQ>. MQQQ is a mirrored PFLINK<Invesco QQQ Trust><https://www.nasdaq.com/market-activity/funds-and-etfs/qqq>. MIR reward is reinvested for more LP.",
	"custom.MSLV-UST.desc": "A Mirrored SLV (mAsset) strategy for PFLINK<UST/MSLV><https://app.uniswap.org/#/add/v2/0x9d1555d8cB3C846Bb4f7D5B1B1080872c3166676/0xa47c8bf37f92aBed4A126BDA807A7b7498661acD> an Uniswap V2 LP of UST:MSLV> MSLV is a mirrored PFLINK<iShare Silver Trust><https://www.nasdaq.com/market-activity/funds-and-etfs/slv>. MIR reward is reinvested for more LP.",
	"custom.MBABA-UST.desc": "A Mirrored BABA (mAsset) strategy for PFLINK<UST/MBABA><https://app.uniswap.org/#/add/v2/0x56aA298a19C93c6801FDde870fA63EF75Cc0aF72/0xa47c8bf37f92aBed4A126BDA807A7b7498661acD> an Uniswap V2 LP of UST:MBABA> MBABA is a mirrored PFLINK<Alibaba Group Holding Limited><https://www.nasdaq.com/market-activity/stocks/baba>. MIR reward is reinvested for more LP.",
	"custom.MIM3CRV.desc": "A Convex strategy for PFLINK<MIM3CRV><https://curve.fi/mim> MIM3CRV pool employs a basket of 4 stablecoins to peg to US$1 and the switching between them to be stable at $1, learn more about PFLINK<MIM><https://docs.abracadabra.money>. CRV, CVX and SPELL reward is reinvested for more MIM3CRV.",
	"custom.FEI-TRIBE.desc": "An Uniswap V2 strategy for PFLINK<FEI/TRIBE><https://app.uniswap.org/#/add/v2/0x956f47f50a910163d8bf957cf5846d573e7f87ca/0xc7283b66eb1eb5fb86327f08e1b5816b0720212b> \"FEI is a highly scalable, decentralized, and reserve-backed stablecoin.\" Read more about FEI PFLINK<here><https://medium.com/fei-protocol/what-you-should-know-about-fei-3ccffd4a4bb6>. TRIBE is the governance token that manages the protocol>. TRIBE reward is reinvested for more LP.",
	"custom.ALCX-ETH.desc": "A Sushiswap strategy for PFLINK<ETH/ALCX><https://app.sushi.com/add/0xc02aaa39b223fe8d0a0e5c4f27ead9083c756cc2/0xdbdb4d16eda451d0503b854cf79d55697f90c8df>. ALCX is the governance token for Alchemix Finance. Taken from their website \"Alchemix Finance is a future-yield-backed synthetic asset platform and community DAO. The platform gives you advances on your yield farming via a synthetic token that represents a fungible claim on any underlying collateral in the Alchemix protocol.\" Read more about Alchemix PFLINK<here><https://alchemix-finance.gitbook.io/alchemix-finance/>. ALCX and SUSHI reward are reinvested for more LP.",
	"custom.yvBOOST-ETH.desc": "A Sushiswap strategy for PFLINK<ETH/YVBOOST><https://app.sushi.com/add/ETH/0x9d409a0A012CFbA9B15F6D4B36Ac57A46966Ab9a>. yvBOOST is the upgraded version of yveCRV, which incorporate the weekly reward from veCRV automatically. SUSHI reward is reinvested for more LP. PFLINK<Here is a video showing how yvBOOST works.",
	"custom.USDC.desc": "An affiliate strategy with Yearn for v2 USDC vault. Pickle deposits USDC into Yearn v2 USDC vault where strategies from Yearn will seek the highest yield in the market.",
	"custom.lusdCRV.desc": "An affiliate strategy with Yearn for v2 LUSD vault. Pickle deposits LUSD into Yearn v2 LUSD vault where strategies from Yearn will seek the highest yield in the market.",
	"custom.FRAXCRV.desc": "An affiliate strategy with Yearn for v2 FraxCRV vault. Frax is an fractional-algorithmic stablecoin. Read more about Frax PFLINK<here><https://docs.frax.finance>. Pickle deposits FraxCRV into Yearn v2 FraxCRV vault where strategies from Yearn will seek the highest yield in the market.",
	"custom.IBCRV.desc": "An affiliate strategy with Yearn for v2 Iron Bank CRV vault. Read more about Iron Bank PFLINK<here><https://creamdotfinance.medium.com/introducing-the-iron-bank-bab9417c9a>. Pickle deposits ibCRV into Yearn v2 ibCRV vault where strategies from Yearn will seek the highest yield in the market.",
	"custom.DAI.desc": "A folding DAI strategy in AAVE. DAI is folded until the maximum safe leverage is gained. MATIC reward is sold for more DAI.",
	"custom.am3CRV.desc": "A Curve strategy for PFLINK<am3CRV><https://polygon.curve.fi/aave/deposit>. When you deposit DAI/USDC/USDT into the Curve pool, those stables are wrapped into AAVE interest bearing coins and then deposited inside the pool which means you receive AAVE lending interest as well as Matic rewards distributed on the AAVE protocol.",
	"custom.IS3USD.desc": "A Curve strategy for PFLINK<IS3USD><https://app.iron.finance/swap/pools/is3usd/deposit> pool (IS3USD pool employs the 3 most popular stablecoins to peg to US$1 and the switching between them to be stable at $1, learn more about PFLINK<DAI><https://makerdao.com/en/>, PFLINK<USDC><https://www.circle.com/en/usdc>, and PFLINK<USDT><https://tether.to>. Read more about Iron Finance PFLINK<here><https://docs.iron.finance>. ICE reward is reinvested for more LP.",
	"custom.Mim2CRV.desc": "A Curve strategy for PFLINK<MIM2CRV><https://arbitrum.curve.fi/factory/0/deposit> MIM2CRV pool employs a basket of 3 stablecoins to peg to US$1 and the switching between them to be stable at $1, learn more about PFLINK<MIM><https://docs.abracadabra.money>. SPELL reward is reinvested for more MIM2CRV.",
	"custom.LOOKS.desc": "A LooksRare strategy for single-staking the PFLINK<looks><https://app.uniswap.org/#/swap?inputCurrency=ETH&outputCurrency=0xf4d2888d29d722226fafa5d9b24f9164c092421e> token into a LooksRare reward contract. Stakers earn a share of the platform's ETH fees. This strategy sells the ETH to buy more LOOKS.",
	"custom.saddled4.desc": "A Saddle strategy for earning yield on 4 dollar-coins (AlUSD, Fei, Frax, and LUSD). This strategy accepts the PFLINK<deposit token><https://saddle.exchange/#/pools/d4/deposit> and stakes it in the rewarder contract, which earns FXS, LQTY, ALCX, and Tribe rewards. All rewards are then sold off and used to buy more LP.",
	"custom.PBAMM.desc": "This jar deposits into B.Protocol's Backstop AMM. All ETH liquidations are automatically sold back into users' LUSD positions and all LQTY rewards are staked in the Pickle Jar, which compounds ETH and LUSD rewards. pLQTY is automatically harvested upon withdrawing or depositing.",
	"token.all.pickle.desc": "Pickle Finance is a yield aggregator, auto-compounding users LP positions saving them time and money. The governance token PICKLE can be staked as DILL, to earn a share of the protocols revenues and boost users farm APY. \n\nThe Pickle Protocol is governed by DILL holders who are able to create and vote on proposals for changes to the protocol. DILL holders also get to share in 45% of protocol revenues, as well as boost the PICKLE rewards on their farms.",
	"token.all.snx.desc": "Synthetix is a decentralized synthetic asset issuance protocol founded by Kain Warwick and the Synthetix Foundation. Initially, it was known as Havven when it first launched in September 2017. During its seed round and token sale, it managed to raise $30 million by selling 60 million HAV tokens to investors. In late 2018, the platform expanded its vision and rebranded to Synthetix. Today, the platform is the largest decentralized exchange for derivatives in the decentralized finance (DeFi) space, boasting an impressive ~$700M in total value locked (TVL) as of November 2020. \n\nSynthetic assets or Synths are derivatives that provide exposure to real world assets on the Ethereum blockchain. Similar to derivatives in traditional financial markets, Synths allow users to hedge and reduce their risk, speculate on price movements and gain access to unavailable assets or markets. This is all accomplished without an individual ever holding the underlying asset. \n\nSynthetix Network Token (SNX) is primarily used as collateral to mint synthetic assets. SNX holders can head over to Mintr to stake their SNX into the Synthetix smart contract and create sUSD - synthetic United States dollars. The amount of sUSD minted will depend on two factors: i) the amount of SNX staked, and ii) the collateralization ratio (C-Ratio) of the platform. At present, the C-Ratio is 600%. This means that in order to mint 1 sUSD, a user would need to stake at least 6 SNX as collateral. \n\nSNX is also used to earn rewards. SNX holders who stake their SNX into the platform are incentivized to do so through two main reward mechanisms: i) exchange rewards and ii) staking rewards. Exchange rewards are generated whenever a trade takes place on Synthetix, the value of which can range from 0.1-1% of the trade value, though it is typically 0.3%. Staking rewards meanwhile, are rewards from the protocol's inflationary monetary supply. The new SNX generated by the protocol is given to SNX holders who stake their tokens. Both these rewards are distributed as SNX on a weekly, pro-rata basis and are escrowed for 1 year.  This is subject however, to an individual's compliance with the target C-Ratio.",
	"token.all.uni.desc": "UNI is the governance token for Uniswap. UNI was introduced on 16th September 2020 through a retrospective airdrop to users who have interacted with the protocol either by swapping tokens or by providing liquidity. The UNI token allows token holders to participate in the governance of the protocol. Key decisions such as usage of the treasury or future upgrades can be decided through a governance vote. \n\nUniswap is a decentralized exchange (DEX) that makes it easy for users to swap an ERC-20 token for another ERC-20 token without the need of a centralized intermediary. With a DEX, traders do not have to deposit their tokens on an exchange and be exposed to the security risks of a centralized exchange. \n\nUsers just need an Ethereum wallet like Metamask and they can immediately start swapping tokens. Users can then swap tokens directly without the need of an orderbook. This works using an Automated Market Maker (AMM) where Liquidity Providers (LP) deposit tokens into the smart contract and this liquidity then provides a price quote to traders without relying on any professional market makers. Liquidity Providers are compensated with a 0.3% trading fee for providing liquidity on the protocol. \n\nAn AMM uses a pricing algorithm to price assets. Uniswap uses the “x*y = k” formula to price its assets. Within the formula, x represents the amount of one token in the liquidity pool, y is the amount of the other asset and k is a fixed constant. In Uniswap, the value of both assets constantly remains at a ratio of 50:50. Uniswap popularized the AMM model and other crypto protocols started utilizing the AMM due to its innovative and decentralized features. However, one of the biggest setbacks for the AMM model is impermanent loss. Impermanent loss is the opportunity cost of contributing two crypto assets into a liquidity pool instead of holding the two crypto assets separately outside the liquidity pool. Impermanent loss occurs when the price of one token rises or falls relative to the other. The larger the change, the larger the impermanent loss will be.",
	"token.all.comp.desc": "COMP is the governance token for Compound Protocol and it was distributed since June 2020. It is an ERC-20 token issued on Ethereum. COMP tokens are mainly used for protocol governance. COMP holders can suggest, debate, and implement changes to Compound - without relying on, or requiring, the Compound team whatsoever. COMP also allows its owner to delegate voting rights to an address of their choice. \n\nCompound is a decentralized blockchain protocol that allows users to lend or borrow selected cryptocurrencies. It establishes money markets by pooling assets together and algorithmically setting interest rates based on supply and demand of assets. To supply or lend crypto assets on Compound, users will have to deposit their crypto assets into the Compound protocol and it will be aggregated into a liquidity pool. Once users have made the deposit, they will receive cTokens in return. Users will start accruing interest by holding the cTokens. \n\nOnce assets are supplied to Compound, users are allowed to use the assets as collateral. Based on the collateral factor of the assets deposited, users can start borrowing from Compound. Because Compound uses an overcollateralization model, you can never borrow more than what is collateralized. ",
	"token.all.dai.desc": "Dai is a digital currency pegged to the US dollar that can be used by anyone, anywhere. Dai is backed by collateral deposited into MakerDAO. \n\nMaker is a smart contract lending platform that enables users to take out loans by locking-in collateral in exchange for Dai. It was founded by the Maker Foundation in 2015 as an open-source project to offer economic freedom and opportunities to anyone, anywhere. In 2017, it launched  the Maker governance token (MKR) and its first stablecoin iteration known as the Single Collateral Dai (SAI), which used Ether (ETH) as collateral. \n\nTwo years later in 2019, the Foundation released the Multi-Collateral Dai (DAI), phasing out SAI. The platform has enjoyed widespread adoption and is the largest decentralized lending platform with around $2.58 billion in total value locked (TVL), as of December 2020. \n\nWhat can Dai (DAI) do? Dai has several strong benefits and use cases. Most notably, Dai's soft peg to the US Dollar helps mitigate price volatility. In the cryptocurrency space where price swings are common and dramatic, this feature helps preserve Dai's value and promotes its use as a medium of exchange. \n\nAdditionally, the stablecoin's decentralized nature means that it is highly composable with other decentralized applications (Dapps) such as Compound, Uniswap etc. It also provides greater transparency and censorship resistance compared to centralized solutions. \n\nThe source code for the protocol can be viewed freely by anyone who wishes to do so. Dai holders can also save their Dai and earn interest through the Dai Savings Rate (DSR) mechanism. Further reading on Dai's benefits and use cases can be found in Maker's whitepaper and ecosystem page. ",
	"token.all.usdc.desc": "USD Coin is a digital stablecoin that is pegged to the United States dollar. USD Coin is managed by a consortium called Centre, which was founded by Circle and includes members from the cryptocurrency exchange Coinbase and Bitcoin mining company Bitmain, an investor in Circle.",
	"token.all.usdt.desc": "Pegged to $1 USD, Tether is a cryptocurrency that is hosted on the Ethereum and Bitcoin blockchains, among others. Its tokens are issued by the Hong Kong company Tether Limited, which in turn is controlled by the owners of Bitfinex. \n\nThe USDT peg is maintained via a one-to-one collateral ratio. Tether Limited claims that every USDT in circulation is 100% backed by actual fiat in their reserves. Tether published their balances in their Transparency page. Tether Limited acts as a third-party custodian for the fiat currencies backing USDT. ",
	"token.all.susd.desc": "sUSD, or synthetic USD, is a synthetic asset launched by Synthetix Exchange. sUSD mirrors and tracks the price of USD provided by an oracle - Chainlink.",
	"token.all.crv.desc": "Curve is a decentralized exchange liquidity pool on Ethereum designed for extremely efficient stablecoin trading. CRV is the governance token for Curve Finance. It implemented a complex time-based staking system to exchange CRV into veCRV, where veCRV is an internal token intended for governance purpose and has a right to claim the cash flows generated by the protocol. \n\n1 CRV locked for 4 years = 1veCRV \n\n1 CRV locked for 3 years = 0.75veCRV \n\n1 CRV locked for 2 years = 0.50veCRV \n\n1 CRV locked for 1 year = 0.25veCRV \n\nCurve Finance conducted one of the biggest retroactive token airdrops on 14 August 2020 to reward early users, with a vesting period up to 4 years. It intends to have yield farming for all of its pool, with the reward weightage voted by the veCRV holders. \n\nYield Farming refers to the activity of depositing and locking capital in a DeFi Protocol for the reward of the protocol's native tokens. DeFi protocols need to bootstrap capital to provide liquidity for exchanges, lend to borrowers, underwrite insurance risk, etc. It acts as an incentive to attract users to use the protocol while generating hype, giving out part of its native tokens. \n\nYield farmers will have to constantly monitor their veCRV power to get the maximum payout from the yield farming exercise as veCRV decays with time. There is a calculator built that shows this in detail. For further information do refer to the official documentation. \n\nSimilar to Uniswap, Curve Finance is an Automated Market Maker (AMM) based Decentralised Exchange (DEX). Unlike Uniswap, its main focus is only to swap between assets that are supposed to have the same value. This is useful in the DeFi ecosystem as there are plenty of wrapped tokens and synthetic tokens that aim to mimic the price of the real underlying asset. \n\nFor example, one of the biggest pools is 3CRV, which is a stablecoin pool consisting of DAI, USDT, and USDC. Their ratio in the pool will be based on the supply and demand of the market. Depositing a coin with a lesser ratio will yield the user a higher percentage of the pool. As such when the ratio is heavily tilted to one of the coins, it may serve as a good chance to arbitrage. \n\nCurve Finance also supports yield-bearing tokens. For example, it collaborated with Yearn Finance to release yUSD pools that consisted of yDAI, yUSDT, yUSDC and yTUSD. Users that participated in this pool will not only have yield from the underlying yield-bearing tokens, but also the swap fees generated by the Curve pool. Including the yield farming rewards in terms of CRV tokens, liquidity providers of the pool actually have three sources of yield. ",
	"token.all.weth.desc": "WETH or 'wrapped ether' is Ethereum that has been converted to an ERC-20 token to faciliate development and composability with other ERC-20 tokens/protocols",
	"token.all.eth.desc": "WETH or 'wrapped ether' is Ethereum that has been converted to an ERC-20 token to faciliate development and composability with other ERC-20 tokens/protocols",
	"token.all.wbtc.desc": "Wrapped Bitcoin is an ERC-20 token on the Ethereum blockchain that represents Bitcoin. Each WBTC is backed 1:1 with Bitcoin. Wrapped Bitcoin allows for Bitcoin transfers to be conducted quicker on the Ethereum blockchain and opens up the possibility for BTC to be used in the Ethereum ecosystem. Bitcoin is held in custody by the centralized custodian, BitGo. Bitcoin can be converted to Wrapped Bitcoin and vice versa easily.",
	"token.all.yfi.desc": "Yearn Finance is a suite of products in Decentralized Finance (DeFi) that provides lending aggregation, yield generation, and insurance on the Ethereum blockchain. YFI is the governance token for the Yearn Finance protocol. It can be used to vote and receive cash flows from the fees earned by the protocol. YFI initiated the first community-fair-launched token distribution, giving out 30,000 tokens to early protocol's users by a surprise yield farming announcement back in 17-July-2020. \n\nThe protocol is maintained by various independent developers and is governed by YFI holders. \n\nIt started out as a passion project by Andre Cronje to automate the process of switching capital between lending platforms in search of the best yield offered, as the lending yield is a floating rate rather than fixed rate. Funds are shifted between dYdX, AAVE, and Compound automatically as interest rates change between these protocols. \n\nThe service offered includes major USD tokens such as DAI, USDT, USDC, and TUSD. For example, if a user deposits DAI into yearn.finance, the user will receive yDAI token in return, which is a yield-bearing DAI token. \n\nLater on, it collaborated with Curve Finance to release a yield-bearing USD tokens pool that includes four y-tokens: yDAI, yUSDT, yUSDC and yTUSD, it is named as yUSD. \n\nYearn Finance debuted the vault feature after its token launch, igniting a frenzy on automated yield farming and is considered the initiator of the category of yield farming aggregator. Basically, the vault will help users to claim yield farming rewards and sell it for the underlying assets. \n\nVaults benefit users by socializing gas costs, automating the yield generation and rebalancing process, and automatically shifting capital as opportunities arise. End users also do not need to have proficient knowledge of the underlying protocols involved or DeFi, thus the Vaults represent a passive-investing strategy. It is akin to a crypto hedge fund where the aim is to increase the amount of assets that users deposited. \n\nYearn Finance was launched in July 2020 and its governance token, YFI was released to the community through a fair launch. At its initial release, because there were no fundraising nor valuation placed on Yearn Finance, the market did not fully comprehend the value capture and not able to figure out the market value for it. \n\nAs Yearn Finance continued to attract liquidity by allowing people to easily earn and participate in DeFi, YFI token went from $30 to $43,000 within 2 months from its launch. \n\nIn 2021, Yearn Finance continues to solidify its position as the gold standard for yield aggregator in which it managed to hit an all-time high of $91,000 on May 12th, 2021 alongside with the peak of the cryptocurrency markets. Yield Farming refers to the activity of depositing and locking capital in a DeFi Protocol for the reward of the protocol's native tokens. DeFi protocols need to bootstrap capital to provide liquidity for exchanges, lend to borrowers, underwrite insurance risk, etc. It acts as an incentive to attract users to use the protocol while generating hype, giving out part of its native tokens. \n\nOther than simple yield farming, Yearn Finance also released a product named delegated vault. Delegated vaults basically use any assets as collateral to borrow stablecoins and recycle the stablecoins into a stablecoin vault. Any subsequent earnings are then used to buy back the asset. \n\nFor example, one of the delegated vaults is yETH, where users can deposit ETH and expect to have more ETH when they withdraw. The ETH is sent to Maker DAO as collateral in order to draw DAI where the DAI will be invested into the DAI vault, with subsequent earnings used to buy back ETH. Andre became one of the most famous DeFi thought leaders as he launched Yearn Finance single-handedly, witnessing YFI price went up by roughly 55x in less than 3 months, valuing Yearn Finance by more than $1 billion. He is vocal on Twitter with his ethos of fair token launch and having a bias on launching experimental projects before audits, which gave birth to one of the DeFi main activities “Aping”. \n\nAping basically means buying the tokens the moment it launches in Ethereum mainnet before fully knowing the function of the tokens. It normally involves directly interacting with the Ethereum contract before a website UI is out or buying it straight from DEX such as Uniswap. It is a high risk activity, causing many investors to lose their fund to scams. But the lure of getting early access to tokens that might go up rapidly in price is attracting tons of speculators. \n\nOne of the examples is when Andre launched EMN, a game economy engine called “Eminence” that was subsequently hacked for $15 million. Subsequent launch of the KP3R token, a network that facilitates keepers to perform automated tasks on behalf of requestors, saw the price go up by 22x in less than 3 months, valuing KP3R at more than $100 million. The activity of aping will not die down anytime soon with numerous projects achieving high valuation within a short span of time.  \n\nDuring the weeks of 24 November until 3 December 2020, Yearn Finance announced the Merger and Acquisition (M&A) of multiple protocols, essentially forming an alliance revolving around YFI. \n\nSushiSwap joined as its Automated Market Maker (AMM) arm. \n\nCover joined as its insurance arm. \n\nCream joined as its lending arm. \n\nAkropolis joined as its institutional service provider for yVaults and upcoming lending products. \n\nPickle joined as one of its strategists. \n\nThere are even multiple Yearn Ecosystem Index tokens launched such as YETI by Powerpool and YPIE by PieDAO.",
	"token.all.bac.desc": "Basis Cash is a censorship-resistant and fairly distributed implementation of the Basis Protocol which maintains its peg through algorithmic adjustments to token supply.",
	"token.all.mic.desc": "A fork of Basis Cash, Mithril Cash is a censorship-resistant and fairly distributed implementation of the Basis Protocol which maintains its peg through algorithmic adjustments to token supply.",
	"token.all.mis.desc": "A fork of Basis Shares, Mithril Shares are a medium of governing the protocol and receiving seigniorage rewards.",
	"token.all.ldo.desc": "Lido is a liquid staking solution for ETH 2.0 backed by industry-leading staking providers. Lido lets users stake their ETH - without locking assets or maintaining infrastructure - whilst participating in on-chain activities, e.g. lending. Lido attempts to solve the problems associated with initial ETH 2.0 staking - illiquidity, immovability and accessibility - making staked ETH liquid and allowing for participation with any amount of ETH to improve security of the Ethereum network.",
	"token.all.yvecrv.desc": "yveCRV stands for veCRV-DAO yVault and represents a share of Yearn Finance's yveCRV vault. The user deposits CRV that is locked forever and non-redeemable in exchange for rewards from trading fees, CRV rewards and Yearn boosts",
	"token.all.bas.desc": "Shares are a medium of governing the protocol, and receiving seigniorage rewards through the Boardroom. Basis Shares are an implementation of the Seigniorage Shares paper ⸺ they are not pegged to anything; as BAC adoption grows, so does BAS' value.",
	"token.all.mir.desc": "Mirror is a synthetics protocol for on-chain price exposure to real-world assets such as Apple, Tesla, and Alibaba - accessible to all.",
	"token.all.ust.desc": "A dollar pegged stablecoin, UST maintains stability through a simple swap mechanism: 1 UST can be exchanged for 1 dollar worth of LUNA at any time. If UST becomes less valuable than $1.00, buyers can scoop it up and use the swap mechanism to sell it for $1.00, enabling them to make a profit³. As buyers do this, demand for UST causes the price to go up again until it reaches $1 USD. These economic incentives act rapidly to maintain UST stability.",
	"token.all.mtsla.desc": "A synthetic asset by Mirror Protocol, MTSLA gives users on-chain price exposure to American electric automobile manufacturer, Tesla Motors.",
	"token.all.maapl.desc": "A synthetic asset by Mirror Protocol, MAAPL gives users on-chain price exposure to American multinational technology company, Apple.",
	"token.all.mqqq.desc": "A synthetic asset by Mirror Protocol, MQQQ gives users on-chain price exposure to Invesco QQQ; an exchange-traded fund that tracks the Nasdaq-100 Index and features Apple, Google, Microsoft, and more.",
	"token.all.mslv.desc": "A synthetic asset by Mirror Protocol, MSLV gives users on-chain price exposure to iShare Silver Trust (SLV). The fund, which launched in 2006, currently holds 544 million ounces of physical silver in its vaults, located in England and the U.S. Thus, SLV shares are a physically backed representation of the price of silver.",
	"token.all.mbaba.desc": "A synthetic asset by Mirror Protocol, MBABA gives users on-chain price exposure to Alibaba, a Chinese multinational technology company specializing in e-commerce, retail, Internet, and technology.",
	"token.all.sushi.desc": "A fork of Uniswap, Sushiswap is a fully decentralized protocol for automated liquidity provision on Ethereum. Sushi is notable for vampire attacking Uniswap at launch and developing the Masterchef contract.",
	"token.all.fei.desc": "FEI is a USD-pegged asset that uses a new kind of stablecoin mechanism called protocol controlled value (PCV). It is more capital-efficient, has a fair distribution, and is fully decentralized. The protocol uses the value it controls to maintain liquid secondary markets.",
	"token.all.tribe.desc": "The TRIBE governance token is collectively responsible for managing the Fei DAO.",
	"token.all.lusd.desc": "LUSD is a fully redeemable USD-pegged stablecoin issued by the Liquity Protocol. Liquity is a decentralized borrowing protocol that allows you to draw 0% interest loans against Ether used as collateral. Loans are paid out in LUSD and need to maintain a minimum collateral ratio of only 110%.",
	"token.all.frax.desc": "Inventors of the fractional stablecoin. FRAX is the 1st stablecoin with parts backed & parts algorithmic similar to traditional reserve banking.",
	"token.all.alcx.desc": "Alchemix is a DeFi protocol that allows for the creation of synthetic tokens that represent the future yield of a deposit. It enables users to retrieve near instant tokenized value against temporary* deposits of stablecoins.",
	"token.all.alusd.desc": "alUSD is a yield-backed synthetic stablecoin powered by the Alchemix protocol",
	"token.all.luna.desc": "Luna is the reserve currency of the Terra platform. It has three core functions: i) mine Terra transactions through staking, ii) ensure the price stability of Terra stablecoins and iii) provide incentives for the platform’s blockchain validators. Terra is a decentralized financial payment network that rebuilds the traditional payment stack on the blockchain. It utilizes a basket of fiat-pegged stablecoins, algorithmically stabilized by its reserve currency Luna, to facilitate programmable payments and open financial infrastructure development. As of December 2020, the network has transacted an estimated $299 billion for over 2 million users.",
	"token.all.yvboost.desc": "The yvBOOST token is a share of a fully automated and compounding version of the yveCRV yVault. To put it simply, this vault claims your weekly 3CRV rewards automatically and uses them to acquire more yveCRV (either via market-buy or mint, depending on which is most efficient at time of harvest).",
	"token.all.cvx.desc": "Convex is a protocol that simplifies Curve boosting experience in order to maximize yields. Convex allows Curve liquidity providers to earn trading fees and claim boosted CRV without locking CRV themselves. \n\nLiquidity providers can receive boosted CRV and liquidity mining rewards with minimal effort. If you would like to stake CRV, Convex lets users receive trading fees as well as a share of boosted CRV received by liquidity providers. This allows for a better balance between liquidity providers and CRV stakers as well as better capital efficiency.",
	"token.all.fxs.desc": "The Frax Share token (FXS) is the non-stable, utility token in the Frax protocol. It is meant to be volatile and hold rights to governance and all utility of the system. \n\nIt is important to note that Frax Finance takes a highly governance-minimized approach to designing trustless money in the same ethos as Bitcoin. Frax eschews DAO-like active management such as MakerDAO. The less parameters for a community to be able to actively manage, the less there is to disagree on. \n\nParameters that are up for governance through FXS include adding/adjusting collateral pools, adjusting various fees (like minting or redeeming), and refreshing the rate of the collateral ratio. No other actions such as active management of collateral or addition of human-modifiable parameters are possible other than a hardfork that would require voluntarily moving to a new implementation entirely. \n\nThe FXS token has the potential of upside utility and downside utility of the system, where the delta changes in value are always stabilized away from the FRAX token itself. FXS supply is initially set to 100 million tokens at genesis, but the amount in circulation will likely be deflationary as FRAX is minted at higher algorithmic ratios. The design of the protocol is such that FXS would be largely deflationary in supply as long as FRAX demand grows. \n\nThe FXS token's market capitalization should be calculated as the future expected net value creation from seigniorage of FRAX tokens in perpetuity, the cash flow from minting and redemption fees, and utilization of unused collateral. Additionally, as the market cap of FXS increases, so does the system's ability to keep FRAX stable. \n\nThus, the priority in the design is to accrue maximal value to the FXS token while maintaining FRAX as a stable currency. As Robert Sam's described in the original Seigniorage Shares whitepaper: “Share tokens are like the asset side of a central bank's balance sheet. The market capitalisation of shares at any point in time fixes the upper limit on how much the coin supply can be reduced.” Likewise, the Frax protocol takes inspiration from Sams' proposal as Frax is a hybrid (fractional) seigniorage shares model. \n\nAs of May 2020, the protocol now allows FXS holders to lock up FXS tokens to generate veFXS and earn special boosts, special governance rights, and AMO profits. Check the in depth veFXS specs for more information on how all veFXS features function.",
	"token.all.cvxfxs.desc": "cvxFXS is Frax Share Token wrapped by Convex. It funtions similarly to cvxCRV in that users may deposit FXS into Convex to earn boosted rewards.",
	"token.all.lqty.desc": "LQTY is a token that captures the fee revenue generated by the Liquity Protocol via staking. Liquity is a decentralized borrowing protocol that allows you to draw 0% interest loans against Ether used as collateral. Loans are paid out in LUSD and need to maintain a minimum collateral ratio of only 110%.",
	"token.all.3crv.desc": "3CRV is the LP token for the Curve 3pool. Curve Finance collects trading fee and deposit/withdrawal fees from each pool, and converts them into 3CRV token, the LP token of Curve's largest pool, 3pool. 3CRV is roughly the volume weighted average price of USDT, USDC and DAI in 3pool, so its price is approximately US $1.",
	"token.all.scrv.desc": "sCRV is a synthetic version of CRV issued by Synthetix protocol.",
	"token.all.spell.desc": "SPELL is a reward token associated with abracadabra.money, a lending platform that uses interest-bearing tokens (ibTKNs) as collateral to borrow a USD-pegged stablecoin called Magic Internet Money (MIM). \n\nAbracadabra uses the Kashi Lending Technology pioneered by SushiSwap (SUSHI) to provide isolated lending markets that allow users to adjust their risk tolerance according to the collateral they decide to use. \n\nUsers can deposit collateral and borrow MIM against it. Abracadabra also offers yield farming opportunities, where users can stake their liquidity provider (LP) tokens to farm SPELL. This facilitates better liquidity for certain cryptocurrency pairs, currently Ether (ETH)-Spell Token (SPELL) and Magic Internet Money (MIM)-LP 3pool Curve (3CRV). \n\nFurthermore, users can also open leveraged farming positions using borrowed MIM from their interest-bearing collateral by looping their borrowed loan back into their collateral position and borrowing more MIM.",
	"token.all.mim.desc": "SPELL is a reward token associated with abracadabra.money, a lending platform that uses interest-bearing tokens (ibTKNs) as collateral to borrow a USD-pegged stablecoin called Magic Internet Money (MIM). \n\nAbracadabra uses the Kashi Lending Technology pioneered by SushiSwap (SUSHI) to provide isolated lending markets that allow users to adjust their risk tolerance according to the collateral they decide to use. \n\nUsers can deposit collateral and borrow MIM against it. Abracadabra also offers yield farming opportunities, where users can stake their liquidity provider (LP) tokens to farm SPELL. This facilitates better liquidity for certain cryptocurrency pairs, currently Ether (ETH)-Spell Token (SPELL) and Magic Internet Money (MIM)-LP 3pool Curve (3CRV). \n\nFurthermore, users can also open leveraged farming positions using borrowed MIM from their interest-bearing collateral by looping their borrowed loan back into their collateral position and borrowing more MIM.",
	"token.all.fox.desc": "FOX represents shares of the ShapeShift platform. ShapeShift is the only cryptocurrency trading platform offering zero-commission crypto trading and self-custody.",
	"token.all.tru.desc": "TRU is a DeFi uncollateralized lending protocol developed by the TrustToken team. Lenders can borrow cryptocurrencies with predictable loan rates without the need to pledge collaterals like Aave, Compound, and Venus. \n\nIn the long term, TrueFi aims to become a market-driven, automated credit rating and lending system. This will demand building beyond the rigid, conservative constraints such as minimum/maximum APY and high TRU participation factor. \n\nIt will also require increased levels of responsibility from users, especially for onboarding new borrowers beyond the pre-approved whitelist and approving new loan types.",
	"token.all.rly.desc": "Rally is a platform for creators and their communities to build their own independent digital economies. Users can own social token that enables transactions, access, and more creative solutions for their economy.",
	"token.all.cvxcrv.desc": "cvxCRV is tokenized veCRV (locked CRV) issued by Convex Finance. If a user deposits CRV into Convex, that CRV is locked forever on the platform as veCRV. A tokenized version of veCRV, cvxCRV, is returned to the user at a 1:1 rate.",
	"token.all.rbn.desc": "Ribbon Finance is a protocol that helps users access crypto structured products for DeFi. It combine options, futures, and fixed income to improve a portfolio's risk-return profile. Ribbon's first product focuses on yield through automated options strategies.",
	"token.all.newo.desc": "New Order was created with a goal to build a self-governing incubator positioned to assist DeFi innovation, through promoting new asset classes, chain independence and machine learning. Their community includes some of the most accomplished and respected DeFi and Web3 professionals and projects.",
	"token.all.looks.desc": "LooksRare is the community-first NFT marketplace with rewards for participating. Buy NFTs (or sell 'em) to earn rewards. Users are able to stake LOOKS to earn emissions and platform NFT trading fees.",
	"token.all.must.desc": "MUST is a token representing shares in Cometh, a DeFi powered space game focusing on yield generating NFTs. Users can buy and sell powered NFT spaceships which allow for the mining of asteriods that provide on-chain rewards such as LP tokens for Cometh's decentralized exchange.",
	"token.all.matic.desc": "Polygon (Previously Matic Network) is the first well-structured, easy-to-use platform for Ethereum scaling and infrastructure development. Its core component is Polygon SDK, a modular, flexible framework that supports building multiple types of applications. Polygon effectively transforms Ethereum into a full-fledged multi-chain system (aka Internet of Blockchains). This multi-chain system is akin to other ones such as Polkadot, Cosmos, Avalanche etc with the advantages of Ethereum’s security, vibrant ecosystem and openness.",
	"token.all.mimatic.desc": "Similar to MakerDAO's Dai, miMatic, or MAI, is a stablecoin backed by locked collateral tokens. MAI borrowing is decentralized and non-custodial, meaning that only users have control over their funds. \n\nMAI can only be made through locking collateral to back its value - either through approved collateral in vaults or through Anchor. Collateral can be static tokens like LINK, CRV, and others. It can also be exotic assets like Beefy and Yearn strategies. Interest-bearing collateral like Beefy, Yearn, and Aave receipt tokens allow users to accumulate yield from their collateral while it's deposited in MAI vaults. \n\nTo make MAI through vaults, users can deposit collateral in their vaults and mint MAI against it. You will not be charged interest for minting MAI through vaults. This means you can hold MAI debt long term without accruing costs.",
	"token.all.qi.desc": "A fork of Maker, the Qi token allows those who hold it to vote on changes to the QiDao Protocol. Anyone, not only Qi holders, can submit proposals for a Qi vote. Qi tokens have to be staked to form xQi in order to vote. Qi holders will decide in a consensus how to distribute the Treasury funds to pay for various infrastructure needs and services. The funds in the Treasury are revenues from Closing Fees, and other income streams. The governance mechanism is designed to be flexible and upgradeable over time.",
	"token.all.dino.desc": "DinoSwap, launching on Polygon, is a cross-chain infrastructure platform that builds liquidity for layer-one blockchains, AMMs and partnering projects. The purpose of the DINO token is to facilitate and promote cross chain DeFi liquidity. DINO tokens are a reward for liquidity providers in available farms. DINO itself can be staked/burned in pools to earn different tokens as rewards.",
	"token.all.ice.desc": "The official Iron Finance token is the ICE token, inspired by A Song of Ice and Fire novels, where the Iron Throne is a well-known symbol. Iron Finance is a multi-chain, decentralized, non-custodial ecosystem of DeFi products, protocols, and use cases. Iron Finance is currently live on Polygon, Avalanche, & Fantom offering services such as swaps, lending, and stablecoin solutions",
	"token.all.work.desc": "The WORK Rewards (“WORK”) of the Employment Commons (the “Commons”) aligns economic incentives between Commons Members to support the future of the independent, self-sovereign worker. There are two types of Members in the Commons; Employee and Coalition. The Commons economic model allows for Stakeholder Capitalism in a collectively owned, for-purpose (and profit) digital employment cooperative, as discussed in the Opolis Off-White Paper. \n\nWORK is designed as a Cooperative Patronage Rewards token used as a means of incentivizing stakeholders to engage in certain patronage activities deemed valuable by the Commons. WORK tokens are a unit of account to determine the amount of patronage profits a Member is entitled to if/when they are declared by the Commons.",
	"token.all.raider.desc": "Crypto Raiders, a utility-based NFT RPG game that draws inspiration from Zed.Run and World of Warcraft, allows you to do just that. Raid dungeons, conquer enemies, earn loot and return to your homeland victorious. But be careful, if you’re unable to survive a meeting with your foe, you won’t get the chance to return victorious. Because death in the game is permanent.The RAIDER token represents the Crypto Raiders economy as a whole, but it also provides some in-game uses. Holders can stake RAIDER to earn a share of all AURUM spent in the game. RAIDER stakers will be rewarded daily based on in-game activity, earning AURUM which they can sell on the market, or use for value-creation activities like running dungeons, breeding, and crafting.",
	"token.all.aurum.desc": "As a utility token for Crypto Raiders, AURUM is a variable supply token with an initial mint of 1,000,000,000. In order to balance the game economy we reserve the right to mint and burn AURUM as needed, as well as to adjust the prices of various activities AURUM is used on such as character creation and dungeons.",
	"token.all.2crv.desc": "Similar to Curve's 3pool, 2CRV is roughly the volume weighted average price of USDT and USDC in 2pool, so its price is approximately US 1.",
	"token.all.dodo.desc": "DODO is a decentralized exchange platform powered by the Proactive Market Maker (PMM) algorithm. It features highly capital-efficient liquidity pools that support single-token provision, reduce impermanent loss, and minimize slippage for traders. The DODO token functions as a rewards token, gives users governance rights, and trading fee discounts on the platform.",
	"token.all.hnd.desc": "The HND token is the native token of the Hundred Finance protocol and can be used to mint veHND, the governance token of the Hundred Finance protocol. veHND confers on the community of holders the power to direct the protocol as they see fit.",
	"token.all.bal.desc": "The BAL token is used for governing the Balancer protocol. Balancer is a community-driven protocol, automated portfolio manager, liquidity provider, and price sensor that empowers decentralized exchange and the automated portfolio management of tokens on the Ethereum blockchain and other EVM compatible systems. Balancer Pools contains two or more tokens that traders can swap between.",
	"token.all.gohm.desc": "gOHM is the wrapped version of the OlympusDAO token OHM which can be used more flexibily across DeFi. OHM aspires to become an algorithmic reserve currency backed by other decentralized assets. \n\nSimilar to the idea of the gold standard, OHM provides free floating value its users can always fall back on, simply because of the fractional treasury reserves OHM draws its intrinsic value from. Each OHM is backed by 1 DAI, not pegged to it. Because the treasury backs every OHM with at least 1 DAI, the protocol would buy back and burn OHM when it trades below 1 DAI. This has the effect of pushing OHM price back up to 1 DAI. OHM could always trade above 1 DAI because there is no upper limit imposed by the protocol. Think pegged == 1, while backed >= 1. You might say that the OHM floor price or intrinsic value is 1 DAI, but in reality, the actual price will always be 1 DAI + premium with the premium being decided by the market. \n\nAt a high level, OlympusDAO consists of its protocol managed treasury, protocol owned liquidity (POL), bond mechanism, and staking rewards that are designed to control supply expansion. Bond sales generate profit for the protocol, and the treasury uses the profit to mint OHM and distribute them to stakers. With liquidity bonds, the protocol is able to accumulate its own liquidity. As the protocol earns revenue, the token price rebases so that every OHM holder will always own the same overall percentage of the protocol. \n\nIn the long term, OHM hopes to acquire enough assets into its treasury to provide a solid backing for a completely decentralized store of value and medium of exchange not unlike Bitcoin.",
	"token.all.magic.desc": "Building bridges between metaverses with MAGIC ✨and treasures, TreasureDAO is a decentralized NFT ecosystem on Arbitrum that is built specifically for metaverse projects. Every project listed on Treasure's marketplace utilizes MAGIC in their respective metaverses, with each community inventing its own lore and storytelling for this resource. \n\nMAGIC, the native token of Treasure, is the sole currency for marketplace transactions. In this way, MAGIC acts as the reserve currency for the entire web of metaverses connected under the Treasure umbrella.",
	"token.all.vsta.desc": "Vesta Finance allows you to borrow collateralized stablecoin against supported crypto assets with no interest rate. Vesta is a fork of Liquity that allows for more diverse collateral backings. The VSTA token serves to govern the Vesta protocol.",
	"token.all.btck.desc": "BTCK is a wrapped version of Bitcoin, similar to WBTC and BitGo. It is maintained by the OKEX exchange.",
	"token.all.bxh.desc": "Governance token for BXH DEX, farmed through liquidity mining similar to other DEX tokens, a certain amount of tokens are repurchased and burned. The project is a DEX on Huobi Eco Chain mainly aimed at the Chinese market, an English interface is also available. BXH stands for 'Bitcoin DEX on HECO'.",
	"token.all.cherry.desc": "The CHERRY token governs CherrySwap on OKExChain. The protocol adopts the mechanism of an Automatic Market Maker (AMM) and aims to achieve self-driven liquidity creation with diversified functions such as liquidity mining, IFOs, NFTs, and lotteries.",
	"token.all.ethk.desc": "ETHK is a wrapped version of Ether, similar to WETH. It is maintained by the OKEX exchange.",
	"token.all.wokt.desc": "WOKT is a wrapped version of OKT. Like wrapped Ether, wrapped OKT allows for more flexible and composable usages of the native token.",
	"token.all.jswap.desc": "Jswap.Finance a decentralized exchange and financial management protocol. The total amount of the governance token JF is 100 million. All profits of the platform are used for JF buying and burning. The token supports a series of functions such as swaps, LP Farming, aggregate financial management,  and cross-chain bridging.",
	"token.all.daiK.desc": "DAIK is a wrapped version of DAI for the OKExChain.",
	"token.all.movr.desc": "MOVR is the native token for the Moonriver Chain. Moonriver is a fully Ethereum-compatible smart contract parachain on Kusama. Moonriver provides a full EVM implementation, a Web3-compatible API, and bridges that connect Moonriver to existing Ethereum networks. \n\nIt is intended to be a companion network to Moonbeam (on Polkadot), where it will provide a permanently incentivized canary network. New code will ship to Moonriver first, where it can be tested and verified under real economic conditions. Once proven, the same code will ship to Moonbeam on Polkadot.",
	"token.all.solar.desc": "Solarbeam is a decentralized exchange, providing liquidity and enabling peer-to-peer transactions on the Moonriver Network. SOLAR is a governance token that can either be staked or locked. 0.025% of all trade volume burns SOLAR. Solarbeam is the canary of Solareflare on the Moonbeam network.",
	"token.all.avax.desc": "AVAX is the native token for the Avalanche Network. Avalanche is a decentralized, open-source proof of stake blockchain with smart contract functionality. Avalanche was developed by a research team from Cornell University as a startup technology company founded to develop a blockchain network that would meet complex finance industry requirements.",
	"token.all.bnb.desc": "Binance Coin (BNB) is an exchange-based token created and issued by the cryptocurrency exchange Binance. Initially created on the Ethereum blockchain as an ERC-20 token in July 2017, BNB was migrated over to Binance Chain in February 2019 and became the native coin of the Binance Chain. Several rounds of token burn events have appreciated BNB price and pushed it up as one of the top-10 cryptocurrencies by market capitalization.",
	"token.all.busd.desc": "Binance USD (BUSD) is a stablecoin pegged to USD issued by Binance Exchange that has received approval from the New York State Department of Financial Services (NYDFS). BUSD is available for direct purchase and redemption at a rate of 1 BUSD = 1 USD.",
	"token.all.usdc-2.desc": "USD Coin is a digital stablecoin that is pegged to the United States dollar. USD Coin is managed by a consortium called Centre, which was founded by Circle and includes members from the cryptocurrency exchange Coinbase and Bitcoin mining company Bitmain, an investor in Circle.",
	"token.all.ftm.desc": "FANTOM is a DAG based Smart Contract platform that intends to solve the scalability issues of existing public distributed ledger technologies. The platform intends to distinguish itself from the traditional block ledger-based storage infrastructure by attempting to employ an improved version of existing DAG-based pro-tocols. The FANTOM platform adopts a new protocol known as the “Lachesis Protocol” to maintain consensus. The aim is to allow applications built on top of the FANTOM OPERA Chain to enjoy instant transactions and near zero transaction costs for all users.",
	"token.all.rib.desc": "Riverboat or RIB is a token that is part of the Seascape NFT Gaming ecosystem. Seascape Finance focuses on intertwining DeFi and gaming to bring a new experience for web3 users.",
	"token.all.pets.desc": "The PETS token is the governance token for the MicroPets platform. MicroPets is a Binance Smart Chain token that capitalises on the current meme coin and NFT hype. We’ve taken everyone’s favorite memes and packaged them up into adorable pets you can trade or stake.",
	"token.all.relay.desc": "RELAY is the protocol token for the Relay Network. RELAY is a multi cross-chain platform developed to bring BaaS (Bridging as a Service) to help the often fragmented DeFi liquidity space. Relay's bridges were first to introduce the bridge gas token faucet to Defi where the bridge itself airdrops the native gas token to new users to reduce friction for people starting out on new chains.",
	"token.all.ksm.desc": "KSM is the native chain token for Kusama. Kusama is a public blockchain network that is running the exact same codebase as Polkadot. It is aimed to be a canary build for the Polkadot network which is an experimental and development environment for new features that will eventually be deployed to Polkadot. Because of the experimental nature of Kusama, the developmental speed is much faster and it has seen significant traction since launched in 2019.",
	"token.all.finn.desc": "FINN is Huckleberry's governance and reward token. It is a reflect token, meaning 1% of every FINN transaction is automatically shared among all FINN holders, proportional to their holdings. Thematically based on Mark Twain's 1884 classic, 'The Adventures of Huckleberry Finn', Huckleberry the exchange is a community driven AMM crosschain DEX built on Moonriver.",
	"token.all.rmrk.desc": "RMRK is the governance, staking, and collateral token for the RMRK protocol .Rmrk is an advanced nft system, adding eternal liquidity and multi chain forward compatibility to all NFT projects coming out. An NFT can now be reused by any future project on any chain without official partnerships between the project creators. RMRK is a part of Kusama's broader NFT strategy and a way to utilize Kusama's system.remark extrinsic to write custom notes onto the chain in a standardized and structured way.",
	"token.all.dot.desc": "DOT is the native token of the Polkadot Network. Polkadot is a platform that allows diverse blockchains to transfer messages, including value, in a trust-free fashion; sharing their unique features while pooling their security. In brief, Polkadot is a scalable heterogeneous multi-chain technology. \n\nPolkadot is heterogeneous because it is entirely flexible and makes no assumption about the nature or structure of the chains in the network. Even non-blockchain systems or data structures can become parachains if they fulfill a set of criteria. Polkadot may be considered equivalent to a set of independent chains (e.g. a set containing Ethereum, Ethereum Classic, Namecoin and Bitcoin) except with important additions: pooled security and trust-free interchain transactability.",
	"token.all.cro.desc": "CRO is the native token of the Cronos Network. CRO coin is the token for the Crypto.com platform. It has 3 main functionalities, trading, payment, and financial services. CRO coin holders will be able to enjoy benefits such as discounted fees, higher earnings for lending, and priority services. Card holders having CRO will also be entitled to additional perks such as airport lounge and rewards. It also has its own blockchain where it acts as a cross-asset intermediary settlement layer using CRO.",
	"token.all.vvs.desc": "VVS Finance is a decentralized finance and automated market making platform on the Cronos network by Crypto.com. The VVS token is the platform's native token. It is a utility, governance, and reward token with applications throughout the VVS platform.",
	"token.all.btc.desc": "Bitcoin is a cryptocurrency developed by the anonymous Satoshi Nakamoto. It is a decentralized digital currency that is based on cryptography. As such, it can operate without the need of a central authority like a central bank or a company. It is unlike government-issued or fiat currencies such as US Dollars or Euros in which they are controlled by the country’s central bank. The decentralized nature allows it to operate on a peer-to-peer network whereby users are able to send funds to each other without going through intermediaries.",
	"token.all.shib.desc": "Shiba Inu (SHIB) is a meme token which began as a fun currency and has now transformed into a decentralized ecosystem. During the initial launch, 50% of the supply was allocated into Vitalik Buterin's ethereum wallet. The price of SHIB has soared from as low as $0.000000000056 to an all time high of $0.000084, that is a 150,000 times increase within 8 months. As a result of that, Vitalik proceeded to donate 10% of his SHIB holdings to a COVID-19 relief effort in India and the remaining 40% is burnt forever. That donation was worth about $1 billion at that time, which makes it one of the largest donation ever in the world.",
	"token.all.bifi.desc": "BIFI tokens are 'dividend-eligible' revenue shares in Beefy Finance through which holders earn profits generated by Beefy Finance and are entitled to vote on important platform decisions. Beefy Finance focuses on yield optimization for users through a set of investment strategies secured and enforced by smart contracts. Beefy Finance automatically maximizes the user rewards from various liquidity pools (LPs), automated market making (AMM) projects, and other yield farming opportunities in the DeFi ecosystem.",
	"token.all.tri.desc": "TRI is a governance and revenue-share token for the Trisolaris protocol. TriSolaris is a decentralized exchange (DEX) on the Near blockchain, running on NEAR's Aurora engine. TriSolaris delivers high-speed trading to users at less than a fraction of the cost of Ethereum or any Ethereum L2.",
	"token.all.near.desc": "NEAR is a sharded, developer-friendly, proof-of-stake public blockchain, built by a world-class team that has built some of the world's only sharded databases at scale. The NEAR network is carbon-neutral certified by the Greenhouse Gas Protocol Standard.",
	"token.all.aurora.desc": "The AURORA token is the native token for the Aurora Network. Aurora is an EVM built on the NEAR Protocol, delivering a turn-key solution for developers to operate their apps on an Ethereum-compatible, high-throughput, scalable and future-safe platform, with low transaction costs for their users.",
	"token.all.pad.desc": "PAD is the protocol token for the NearPad platform built on the Aurora network. It has various different uses among the NearPad suite of products which include a DEX and incubator.",
	"token.all.wanna.desc": "WANNA is the protocol token for WannaSwap. WannaSwap is a self-described liquidity center built on NEAR's Aurora EVM. In addition to a DEX, WannaSwap's ultimate goal 'is to maximize the benefits for users, build an ecosystem on Near and contribute to the development of the crypto world - Be the liquidity hub'. The WANNA token is used for liquidity mining incentives and can be staked for revenue sharing.",
	"token.all.rose.desc": "The ROSE token is used for incentivization, governance, and as collateral for lending iwth the Rose Protocol built on Aurora. Rose is a liquidity protocol on Aurora composed of a stablecoin & wrapped assets exchange, and a Collateralized Debt Position (CDP) based stablecoin utilizing interest bearing tokens as collateral.",
	"token.all.brl.desc": "The BRL token is primarily used for incentivization for liquidity miners for the Auroraswap protocol. Auroraswap is a innovation-centered DEX built on the Aurora network.",
	"token.all.nett.desc": "NETT is used for incentivization and staking for the Netswap exchange. Netswap is the 1st Native DEX built on Metis Andromeda Layer 2 Network, benefiting from its lightspeed and low-cost transaction, security, scalability, decentralization and much more advantages.",
	"token.all.metis.desc": "METIS is the native token for the Metis Andromeda Chain. Based on the spirit of Optimistic Rollup, Metis is building an easy-to-use, highly scalable, low-cost, and fully functional Layer 2 framework (Metis Rollup) to fully support the application and business migration from Web 2.0 to Web 3.0. \n\nIts scalable protocol supports a wide range of use cases including yield farming, DEX trading, and powering the gig economy via DApps that offer cheap and fast micropayments. Metis integrates the Decentralized Autonomous Company (DAC) framework within its Layer 2 infrastructure, a differentiating factor that makes it easy for any developers, builders, or community leaders to build their applications and communities. \n\nIt also makes it easy to use pre-set tools to facilitate their development, manage collaboration, and enjoy the network effects of the world's largest decentralized finance ecosystem, without the costs and bottlenecks normally associated with Ethereum. Metis' goal is to make building dApps and DACs on its platform so easy to do, even total blockchain novices can make it happen in a matter of minutes.",
	"token.all.tethys.desc": "TETHYS is the protocol token for Tethys Finance on Andromeda. TETHYS can be used for a variety of uses within the platfrom such as staking, governance, lending. The team's mission is to empower the Metis Andromeda network with a fast, secure, reliable, and advanced native decentralized exchange app to handle all kinds of trading needs.",
	"token.all.hades.desc": "A fork of Tomb Finance, the Hades protocol is the first algorithmic token pegged to METIS on the Andromeda network. HADES, like TOMB, is the pegged token that is designed to maintain peg with METIS.",
	"token.all.hellshare.desc": "A fork of Tomb Finance, the Hades protocol is the first algorithmic token pegged to METIS on the Andromeda network. HELLSHARE, like TSHARE, represents a share in the overall protocol and distributes HADES when over peg.",
	"token.all.glmr.desc": "GLMR is the native token for the Moonbeam chain. Moonbeam is a highly specialized Layer 1 chain that mirrors Ethereum's Web3 RPC, accounts, keys, subscriptions, logs, and more. The Moonbeam platform extends the base Ethereum feature set with additional features such as on-chain governance, staking, and cross-chain integrations. \n\nMoonbeam combines the best of both worlds: the familiar and easy-to-use tooling of Ethereum and the scalable, interoperable architecture of Polkadot. Dive into the tools, integrations, and comprehensive tutorials to start using and building on Moonbeam.",
	"token.all.stella.desc": "The STELLA token is the protocol token for StellaSwap. StellaSwap is one of the first automated market-making (AMM), decentralized exchange (DEX) for the Moonbeam parachain network. Users can swap, earn, yield farm, bridge assets, explore new projects and engage in NFT trading all from a single unified platform. \n\nStellaSwap's products are structured in such a way that facilitates decentralized governance of STELLA holders, while continuing to innovate on the collective foundations by design.",
	"token.all.glint.desc": "Beamswap (GLINT) is a DeFi Hub and the first Decentralized exchange (DEX) with an automated market maker (AMM), providing liquidity and peer-to-peer transactions, built on the Moonbeam network. Users can stake GLINT for governance, staking rewards, and participation in the Beamswap launchpad.",
	"token.all.flare.desc": "Solarflare (FLARE) is a decentralized exchange, providing liquidity and enabling peer-to-peer transactions on the Moonbeam Network. 0.025% of all trade volume burns FLARE. Solareflare is the full production version of Solarbeam.",
	"token.all.zip.desc": "Born from the memetic sensation of arbiNYAN that single-handedly brought over $1B of assets to Arbitrum, Zipswap is a Uniswap fork that optimizes network swap fees on Optimism. Zipswap currently offers ERC20 swaps that are cheaper than sending naked Ether. The ZIP tokens serves as incentivization in addition to other utilities within the Zipswap platform.",
	"token.all.oxd.desc": "0XD is the token for 0xDAO. This DAO is a platform built on top of Andre Cronje's Solidly protocol designed to control large amounts of SOLID through the DAO.",
	"token.all.tomb.desc": "The TOMB algorithmic token serves as the backbone of a rapidly growing ecosystem aimed towards bringing liquidity and new use cases to the Opera network. The protocol's underlying mechanism dynamically adjusts TOMB's supply, pushing its price up or down relative to the price of FTM. \n\nInspired by the original idea behind Basis as well as its predecessors (bDollar and soup), Tomb.finance is a multi-token protocol which consists of the following three tokens: \n\n1)Tomb (TOMB). \n\n2) Tomb Shares (TSHARE) 3) Tomb Bonds (TBOND). \n\nWhen TOMB is over peg, TSHARE holders are rewarded with additional TOMB to increase the total supply in the market. \n\nWhen TOMB is under peg, users are able to purchase TBOND from the protocol which can be redeemed for bonus TOMB when TOMB regains its peg with FTM. \n\nIf TOMB succeeds in holding the peg, this will create a mirrored, liquid asset that can be moved around and traded without restrictions, all while benefiting from the price appreciation of the native FTM token. Reaching the peg and holding the peg is crucial, and this will ultimately be what drives the value of TOMB for investors. In the short term, this would mean attractive APRs for liquidity providers on what would essentially be a stable pair.",
	"token.all.ice2.desc": "ICE is the rewards and governance token of Popsicle Finance which can be staked for a share of all fees generated by the protocol. Popsicle Finance aims to manage liquidity across multiple chains in order to increase capital efficiency and automatically provide its users with the highest possible yield on the assets they wish to deploy to liquidity pools. They hope that their products will not only help users but also provide a valuable service to the cryptocurrency ecosystem as a whole.",
	"token.all.lqdr.desc": "LQDR is the rewards and governance token for the Liquid Driver protocol. Users earn LQDR by depositing their LP tokens into the protocol and essentially 'trade' their yield to the protocol in exchange for the LQDR token. \n\nLQDR can then be locked for variable periods of time to earn a share of the platform's overall revenues. Liquid Driver describes itself as 'the first liquidity mining dApp providing liquidity-as-a-service in the Fantom ecosystem'. \n\nThey aim to bring its users more utility, rewards, and long-term benefits through their native token, LQDR, and ultimately become the leading liquidity-on-demand platform for dApps on the Fantom Opera Mainnet.",
	"token.all.boo.desc": "SpookySwap is an automated market-making (AMM) decentralized exchange (DEX) for the Fantom Opera network. Different from other DEXs, SpookySwap invested in building a strong foundation with their BOO token as a governance token, diverse farms, a built in bridge, built in limit orders and user-centered service. \n\nSpookySwap has also gone to great lengths to deliver a strong UX to compete with the convenience of centralized exchanges. The release of SpookySwap's Expert Trading mode was a major step in achieving this goal. \n\nBOO can be staked for xBOO to earn share of protocol revenues, and xBOO itself can be additionally staked for additional rewards from partnered protocols. SpookySwap is currently one of the largest decentralized exchanges on the Fantom Network with plans to move to Ethereum and other chains as well.",
	"token.all.credit.desc": "Launched by the team at Revenant Finance (formerly StakeSteak) on 8 January 2022, Creditum is a lending and borrowing protocol within the Fantom Ecosystem that allows users to borrow (or mint) cUSD, a stablecoin pegged at $1 USD, by posting different tokens as collateral. \n\nWith access to cUSD, users are able to earn an annualized percentage yield (APY) on available farms to earn CREDIT, while maintaining exposure and gain access to other benefits as future projects are launched. \n\nTo participate in Creditum governance or gain a share of Creditum protocol fees, users need to lock their CREDIT for veCREDIT. Your share of voting power and fees is determined by the amount of CREDIT locked and the duration of the locking period. Your share of voting power and fees gradually decreases over time as more people lock up their CREDIT tokens.",
	"token.all.scream.desc": "SCREAM is a lending protocol built on Fantom, for Fantom. SCREAM provides peer-to-peer lending solutions that are fully decentralized, transparent and non-custodial. SCREAM aims to build high-velocity markets for more traditional crypto-asset lending services, but with the goal of improving overall capital-efficiency across a wider range of Fantom-based assets. \n\nSimilar to (and based-from) existing lending platforms like Compound Finance, Aave and C.R.E.A.M. Finance, users are able to lend any supported assets on their money markets, and use their capital as collateral to borrow supported assets. When SCREAM is deposited for xSCREAM, the user's share of xSCREAM increases their holding of SCREAM as fees are accumulated to do buybacks of SCREAM tokens.",
	"token.all.tarot.desc": "Tarot is a decentralized lending protocol on Fantom Opera where users can participate as lenders or borrowers in isolated lending pools. Lenders can supply tokens to any lending pool in the Tarot Protocol to earn passive yield without impermanent loss, while borrowers can deposit LP tokens in a lending pool to borrow additional tokens in the token pair. \n\nThis enables borrowers to leverage their LP tokens for even more LP tokens, allowing for leveraged yield farming and enhanced liquidity providing rewards. The TAROT token can be staked for xTAROT to earn a share of protocol revenues.",
	"token.all.link.desc": "Chainlink is a framework for building Decentralized Oracle Networks (DONs) that bring real-world data onto blockchain networks, enabling the creation of hybrid smart contracts. These DONs provide decentralized services such as Price Feeds, Proof of Reserve, Verifiable Randomness, Keepers, and the ability to connect to any web API. \n\nIt aims to ensure that the external information (pricing, weather data, event outcomes, etc.) and off-chain computations (randomness, transaction automation, fair ordering, etc.) fed to on-chain smart contracts are reliable and tamper-proof. Chainlink oracle networks are blockchain-agnostic and are incentivized through the native LINK token, used for node payments and network collateral.",
	"token.all.treeb.desc": "Retreeb is a new decentralized way to pay that allows its users to act in accordance with today's universal values of ethics, sharing and solidarity. Retreeb is built on the Fantom blockchain, using a fork “Fantom Opera”, with a DAG consensus. Their vision is to build a better future by a better distribution of value using payment. \n\nUtility Treeb is a utility and governance asset for the Retreeb community, which has a fixed supply and variable value. With TREEB staking, you can benefit from free services on your wallet (ex: payment card), earn rewards in Utility TREEB or Stable TREEB and validate in the CSR launchpad the selection of ecological or solidarity projects to be financed.",
	"token.all.any.desc": "Anyswap is a fully decentralized cross chain swap protocol, based on Fusion DCRM technology, with automated pricing and liquidity system. Anyswap is a decentralized application running on the Fusion , Binance Smart Chain , Ethereum and Fantom blockchains. \n\nThe first application from Anyswap is a DEX (Decentralized Exchange), which is called anyswap.exchange. This is the User Guide for the DEX. ANY is the governance token for the protocol. Governance in Anyswap requires ANY tokens to either propose a motion, or to vote on an active motion. The ANY tokens must be on the Fusion blockchain.",
	"token.all.beets.desc": "A Balancer fork, Beethoven X aims to be a one-stop decentralized investment platform on Fantom Opera. With a musical theme based on a zombified rendition of the illustrious Ludwig Van Beethoven and features such as weighted investment pools, stable pools, trading, and farming, what's not to love? Go ahead and stake some of your BEETS to for governance rights and fee-sharing. What are you waiting for?",
	"token.all.spirit.desc": "SpiritSwap is a decentralized exchange using the constant product automated market maker (amm) model on the Fantom network. Liquidity providers can deposit two-sided tokens to create a market pair on the exchange. Transaction fees are low as it is using the Fantom network that is based on proof of stake and has high transaction throughputs. \n\nTrading fees goes to the liquidity providers and stakers of the SPIRIT token. CoinGecko also tracks the SpiritSwap volume. Spiritswap was also one of the first forks of DILL (itself a fork of veCRV), having since introduced boosted gauges for various community-selected pools.",
	"token.all.pills.desc": "'You hear that Mr. Anderson? That is the sound of inevitability!' \n\nMorpheus Swap is a new yield farming & yield aggregator protocol, and powered by Fantom. Their main focus is to provide a safe, stable and profitable experience for those who are ready to take the Red Pill and dive into their promising future ecosystem on Fantom. \n\nMorpheus Swap is a 2 token system which uses MORPH and PILLS. PILLS is the governance token and will be the only token used to farm Neo Pools (allowing you to stake to receive platform revenue), as well as various other features in the future. MORPH will be used to mint PILLS through a burning swap. All MORPH used to mint PILLS will be burned directly.",
	"token.all.deus.desc": "DEUS Finance Evolution is a marketplace of decentralized financial services, where we provide the infrastructure for others to build financial instruments. DEUS infrastructure enables third parties to leverage synthetic stocks, CFDs, options, prediction markets, OTC derivatives, and futures. Similar to how Amazon allows anyone to open up an e-commerce store built on the Amazon platform, DEUS allows any third-party to build on top of DEUS contracts. \n\nThe DEUS system revolves around two tokens, DEUS and DEI. DEI is an algorithmic cross-chain fractional-reserve stablecoin that is open-source and permissionless. DEI's collateral ratio is free-flowing, consisting of roughly 20% DEUS tokens and 80% of another trusted stablecoin (depending on the target chain it's on). This collateral ratio is dynamic, constantly adjusting, and is being monitored by arbitrage bots. \n\nDEUS is the protocol and governance token that represents a share of the DEUS ecosystem. DEUS is used to partially back DEI, this token relationship structure was implemented to directly tie adoption of the DEUS ecosystem and DEI to the deflationary tokenomics of DEUS. DEI is the backbone of the DEUS ecosystem via all synthetic and derivative assets being collateralized by DEI.",
	"token.all.sol.desc": "Solana crypto is a high throughput blockchain based on the Proof of History (PoH) and Proof of Stake (PoS) consensus. Built by a team of networking engineers, Solana aims to become the blockchain infrastucture for modern internet applications. \n\nSolana is a general purpose blockchain similar to Ethereum. It has a different technical underlying such that developers write applications using Rust instead of Solidity or Vyper. End user applications as of now include decentralized finance (DeFi), non-fungible tokens (NFT), marketplaces, games, and more. \n\nOne of its biggest feature is its scalability in which Solana is able to process over 700,000 transactions per second. Its high throughput capability appeals to high frequency traders, in which spearheaded by FTX and Alameda Research. The first use case for DeFi application on Solana is Serum, built by the team behind FTX. Solana's native currency is SOL. Solana (SOL) is used to pay for transaction fees and staking in order to support the network. \n\nAfter experiencing hyperbolic growth in 2021 and with the advent of multichain and increased adoption of DeFi and NFT, Solana managed to capture a large market share. Developers were attracted by the technical underlying and started building dapps such as Star Atlas, Mercurial, Orca, Saber, and more.",
	"token.all.dei.desc": "DEUS Finance Evolution is a marketplace of decentralized financial services, where we provide the infrastructure for others to build financial instruments. DEUS infrastructure enables third parties to leverage synthetic stocks, CFDs, options, prediction markets, OTC derivatives, and futures. Similar to how Amazon allows anyone to open up an e-commerce store built on the Amazon platform, DEUS allows any third-party to build on top of DEUS contracts. \n\nThe DEUS system revolves around two tokens, DEUS and DEI. DEI is an algorithmic cross-chain fractional-reserve stablecoin that is open-source and permissionless. DEI's collateral ratio is free-flowing, consisting of roughly 20% DEUS tokens and 80% of another trusted stablecoin (depending on the target chain it's on). This collateral ratio is dynamic, constantly adjusting, and is being monitored by arbitrage bots. \n\nDEUS is the protocol and governance token that represents a share of the DEUS ecosystem. DEUS is used to partially back DEI, this token relationship structure was implemented to directly tie adoption of the DEUS ecosystem and DEI to the deflationary tokenomics of DEUS. DEI is the backbone of the DEUS ecosystem via all synthetic and derivative assets being collateralized by DEI.",
	"token.all.sex.desc": "Solidex is a protocol to optimize yield, voting power, and liquidity provisioning on Solidly. Solidly is a decentralized exchange (AMM) where tokens may be swapped using liquidity provided by users. \n\nThose users earn SOLID emissions. Those who lock SOLID receive veSOLID and a higher share of SOLID rewards. veSOLID or vote escrowed SOLID, is a concept first introduced by Curve Finance which aims to reward long term users of a protocol. Users who hold veSOLID earn trading rewards from the protocol as well as voting power to direct SOLID emissions. \n\nIf you wish to lock SOLID, Solidex allows you to earn a larger share of trading fees and rewards, as well as a share of boosted SOLID emissions received by liquidity providers in exchange for you providing boost to the protocol. If you wish to be a liquidity provider, Solidex allows you to earn boosted SOLID rewards without having to lock SOLID for several years, as well as additional SEX rewards. If you wish to maximize voting power and influence over SOLID emissions and gauges, Solidex ensures veSOLID is always max locked in order to maximize voting power. \n\nThis influence is then controlled through the SEX token which can be locked for up to 16 weeks and earn additional rewards. Solidex has no deposit or withdrawal fees and a minimal performance fee that is distributed to SOLID and SEX lockers in its entirety. There are no vcs, investors, or advisors.",
	"token.all.solid.desc": "A project developed by Andre Cronje, Solidly offers users quick, seamless, and cheap transactions while utilizing strategies to maximize their yield. \n\nIn short, Solidly is a decentralized exchange (AMM) where tokens may be swapped using liquidity provided by users. Those users earn SOLID emissions. Those who lock SOLID receive veSOLID and a higher share of SOLID rewards. \n\nveSOLID or vote escrowed SOLID, is a concept first introduced by Curve Finance which aims to reward long term users of a protocol. Those who hold veSOLID earn trading rewards from the protocol as well as voting power to direct SOLID emissions. \n\nIf you wish to lock SOLID, Solidex allows you to earn a larger share of trading fees and rewards, as well as a share of boosted SOLID emissions received by liquidity providers in exchange for you providing boost to the protocol. \n\nLeading up to its launch, the project generated a great deal of hype. Numerous DAOs spawned within days of the airdrop announcement, with billions of dollars of assets flooding into the Fantom network to compete for the airdrop awarded to 20 protocols with the most TVL on the chain. ",
	"token.all.cre8r.desc": "CRE8R DAO was founded in June 2021 by a group of DeFi content creators with the goal of organizing content creators into a DAO format. The goal was to create an opportunity for marketing content creators to have a place to monetize their platforms without the need for them to do sales pitches and chase payments for services rendered. \n\nThe idea was that they could focus on the content and have the heavy lifting of business development and sales spread out across the DAO. \n\nIn regard to its tokenomics, CRE8R is an OlympusDAO fork that utilizes its (3,3) mechanics to manage the protocol's treasury. Users can stake CRE8R to earn rolling emissions earned by the protocol similar to OHM.",
	"token.all.scarab.desc": "The SCARAB algorithmic token serves as the backbone of a rapidly growing ecosystem aimed towards bringing liquidity and new use cases to the Fantom Opera Mainnet. The protocol's underlying mechanism dynamically adjusts SCARAB's supply, pushing its price up or down relative to the price of FTM. \n\nInspired by the idea behind the well known project on Fantom Opera Mainnet Tomb Finance, the Scarab protocol consists of three tokens: 1) SCARAB === TOMB 2) GSCARAB === TSHARE 3) SBOND === TBOND. Unlike Tomb Finance, Scarab does not aim to become a store of value but rather to generate external revenue and use treasury funds to maintain the peg.",
	"token.all.gscarab.desc": "The SCARAB algorithmic token serves as the backbone of a rapidly growing ecosystem aimed towards bringing liquidity and new use cases to the Fantom Opera Mainnet. The protocol's underlying mechanism dynamically adjusts SCARAB's supply, pushing its price up or down relative to the price of FTM. \n\nInspired by the idea behind the well known project on Fantom Opera Mainnet Tomb Finance, the Scarab protocol consists of three tokens: \n\n1) SCARAB === TOMB \n2) GSCARAB === TSHARE \n3) SBOND === TBOND. \n\nUnlike Tomb Finance, Scarab does not aim to become a store of value but rather to generate external revenue and use treasury funds to maintain the peg.",
	"token.all.renbtc.desc": "At the surface level, renBTC is similar to wBTC in that it is a wrapped version Bitcoin that is backed by locked Bitcoin. \n\nUnlike wBTC which is a custodial asset managed by BitGo, the Ren Protocol allows for various assets to be ported to DeFi without a central custodian. RenVM replaces the role of the trusted custodian with a decentralised custodian. \n\nThis decentralised custodian is implemented using the RZL MPC algorithm, which can generate and manage ECDSA private keys without ever exposing them (not even to the machines that power RenVM). This improves on WBTC and imBTC by removing the need to trust a centralised custodian. \n\nRenVM is powered by thousands of independently operated machines, known as Darknodes, which require bonds of 100K REN tokens to run. The bond of every Darknode represents a commitment to good behaviour and can be slashed if 1) the Darknode behaves maliciously or 2) if it is responsible for the loss of assets (and the slashed bonds can then be used to restore the lost assets). \n\nDarknodes are periodically shuffled into random non-overlapping groups, known as shards. Each shard uses the RZL MPC algorithm to generate a secret ECDSA private key, unknown to everyone, including the Darknodes in the shard. This secret ECDSA private key cannot be revealed and cannot be used to sign transactions, without cooperation of 1/3rd+ of the Darknodes. This enables each shard to securely lock assets into its custody. \n\nWith these assets secured, the protocol is then able to issue tokens such as renBTC onto smart contract networks.",
	"token.all.woofy.desc": "Woofy is blue dog companion token of YFI (Wifey). It utilizes a special Woof bonding curve which allows two-way conversion between the tokens. \n\nThat means you can be exposed both to a lighthearted dog coin and the DeFi darling blue chip at the same time. Call woof to convert YFI into WOOFY. Call unwoof to convert WOOFY back to YFI. The ratio is always 1 YFI = 1,000,000 WOOFY. \n\nWoofy is always fully backed by YFI.",
	"token.all.syn.desc": "Synapse is a cross-chain layer ∞ protocol powering frictionless interoperability between blockchains. By providing decentralized, permissionless transactions between any L1, sidechain, or L2 ecosystem, Synapse powers integral blockchain activities such as asset transfers, swaps, and generalized messaging with cross-chain functionality - and in so doing enables new primitives based off of its cross-chain architecture. \n\nAt Synapse you can bridge and swap stable assets between chains and provide liquidity to fuel cross-chain swapping in pools with minimal impermanent loss. \n\nThe SYN token can be used for governance and fee-sharing. With plans to launch a chain of its own, SYN can also be used to secure the proof-of-stake consensus model.",
	"token.all.oath.desc": "Created by prominent Fantom developer and founder of Reaper.Farm, Justin Bebis, ByteMasons seeks to imporve access to financial tools, transparency of financial organizations, and ethics in business operations. ByteMasons strvies to set a new starndard for safety, security, and service in the DeFi industry; developing excellence for the betterment of the community and ecosystem. \n\nAs a collective that works to accomplish these goals through a variety of means such as providing crypto services and community outreach, the OATH token represents the ByteMasons DAO. While the token itself is currently used for incentivization, there are plans to develop an entire ecosystem around OATH.",
	"token.all.multi.desc": "Multichain, rebranded from Anyswap, will continue with what it has achieved to date as a router protocol for Web3. As the trailblazer of decentralized cross-chain service, Multichain provides interconnect infrastructure for 27 mainstream public blockchains including Ethereum, Fantom, Binance Smart Chain, Avalanche, Moonriver, Arbitrum, Polygon and Harmony. \n\nThe Total Value Locked (TVL) on Multichain, whose number of users exceeds 300,000, is more than 5 billion, with over 1,000 crypto assets circulating among different mainnets. It is unsurpassed in terms of speed, security and decentralization. Builders can create application layers on top of it to strengthen DeFi composability.",
	"token.all.solidsex.desc": "Solidex is a protocol to optimize yield, voting power, and liquidity provisioning on Solidly. If you wish to be a liquidity provider, allows you to earn boosted SOLID rewards without having to lock SOLID for several years, as well as additional SEX rewards. If you wish to maximize voting power and influence over SOLID emissions and gauges, Solidex ensures veSOLID is always max locked in order to maximize voting power. \n\n1 SOLIDsex is minted for every 1 veSOLID locked in the protocol, this is a constant 1:1 representation. SOLIDsex has 3 primary uses \n\n1) Earning liquidity provider fees: 10% of all SOLID farmed by the protocol (as vanilla SOLID) \n2) Earning SEX: 3.5% of the SEX that gets minted (as vanilla SEX) \n3) Earning down-vote protection fees: Price determined by SEX auction (as vanilla SEX).",
	"token.all.ib.desc": "Iron Bank is a decentralized protocol to protocol lending platform. It allows trusted protocols to borrow funds without posting collateral via whitelisting. It is helping build a better and safer DeFi lending ecosystem, by driving capital efficiency as the liquidity infrastructure and backbone for DeFi and CeFi. \n\nIron Bank provides on-chain undercollateralized/ zero-collateral lending for selected borrowers on Ethereum, Avalanche and Fantom with a unique soft liquidation feature. We hope to support the growth of projects, protocols and institutions by opening up the scale of investment opportunities by maximising access to capital. Lenders can also deposit digital assets on Iron Bank to earn stable yield. \n\nThe IB token can be staked to earn protocol rewards.",
	"token.all.geist.desc": "Geist Finance is a decentralized, non-custodial liquidity market operating on the Fantom Opera blockchain. The core protocol is based on AAVE, the largest DeFi lending protocol by TVL. The staking and fee distribution system is based on Ellipsis Finance. \n\nThe core Geist protocol is a lending market that functions near-identically to Aave. Users may borrow and lend different assets with variable interest rates. These interest rates are determined algorithmically according to the utilization of the lending pool. Asset pricing is determined using Chainlink and Band oracles. When a lender falls below the required collateral ratio, a financial incentive is provided for the liquidator who repays the under collateralized loan. \n\nGEIST liquidity mining employs a mechanism first introduced by Ellipsis Finance. All rewards are vested for 3 months. During this vesting period, users are already earning a share of the revenue generated by the protocol. If a user wishes to withdraw their GEIST at any time during the 3 month vesting period, they may do so by paying a 50% penalty. The GEIST taken as a penalty is then distributed to users who choose to lock GEIST for 3 months. This mechanism ensures steady rewards for those who actively commit to the protocol by locking their tokens. \n\nGEIST is the native token within the Geist protocol. GEIST is a revenue sharing token, not a governance token. The protocol has no concept of governance or ownership, and also no treasury. Instead, 50% of all revenue generated through lending is distributed directly to users who stake GEIST. GEIST tokens can be obtained by buying them from exchanges such as SpookySwap. It can also be obtained as a reward for providing liquidity on Geist.Finance. \n\nAs Geist is based on Aave, many of the core contracts are upgradeable by the owner. The team understands that anonymous devs with the power to upgrade contracts may rightfully make some users feel uncomfortable. To mitigate these concerns, ownership of all Geist smart contracts will be placed behind a Timelock contract with a two day delay for any action. Meanwhile, the Geist multisig is a 3/5 safe with non custodial admin rights over the Geist protocol. The five people on the multisig are: \n\nMichael Chen (Fantom Foundation), \nEerie (SpookySwap co-founder), \n0xngmi (co-founder DefiLlama), \nAveen Hujiari (co-founder Geist), \nCharlie (Curve Finance)",
	"token.all.g3crv.desc": "Similar to Curve's 3POOL on Ethereum, G3CRV is the LP token for the DAI-USDT-USDC curve pool. With G3CRV, however, these component tokens are DAI, USDT, and USDC that have been deposited into Geist. These G tokens earn additional yield from lending on Geist while they are earning yield from Curve. So G3CRV in and of itself is continuously earning double yield on stablecoins.",
	"token.all.rdl.desc": "Radial is a Convex-inspired yield maximization protocol for Solidly which enables LPs to receive boosted rewards while eliminating the need to lock veSOLID themselves. In addition to optimizing for gas (albeit being a small amount on Fantom), managing proportion of SOLID locked to optimally boost yields and promote favourable gauges — the protocol acts as a focal point of coordination between LPs, DAOs/protocols and various veSOLID lockers. RDL may be staked through the website or directly via the contract level. \n\nRDL stakers receive 20% of the 5% fees reserved by Radial for RDL stakers and lockers. That is, 1% of the SOLID LPs earn by staking their Solidly LP tokens on Solidly. The SOLID is distributed to RDL stakers in the form of rdlSOLID after locking the SOLID into the veSOLID NFT Radial maintains. RDL holders may control and direct votes of the veSOLID owned by the Radial protocol by locking their RDL for a minimum of 16 weeks. Vote locking RDL has the following features: \n\n1) Lockers receive vlRDL \n2) vlRDL can direct votes of the underlying veSOLID without any intermediary (multisig) \n3) Voters can directly receive bribes from pools incentivized by bribers on Solidly \n4) Voters receive 80% of the 5% fees reserved by Radial for RDL stakers and lockers. That is, 4% of the SOLID LPs earn by staking their Solidly LP tokens on Solidly. \n5) 50% of the trading fee from Solidly for the pools they voted on.",
	"token.all.rainspirit.desc": "One of the winSpirit tokens, rainSpirit, issued by Ola Finance, is a locked wrapper for veSpirit that allows users to enjoy the rewards of Spirit Finance without locking up their tokens. \n\nUnlike other winSpirit tokens, rainSpirit perserves the voting power of depositors. \n\nIn short, winSpirit tokens let users enjoy inSPIRIT rewards (SpiritSwap's protocol fees) while retaining their ability to exit their positions. Since inSPIRIT is non-transferable and requires a lengthy lock of SPIRIT tokens, users are discouraged from minting inSPIRIT. winSPIRIT forks solve this by wrapping inSPIRIT and incentivizing deep liquidity for their winSPIRIT — SPIRIT pair.",
	"token.all.linspirit.desc": "One of the winSpirit tokens, linSpirit, issued by Liquid Driver, is a locked wrapper for veSpirit that allows users to enjoy the rewards of Spirit Finance without locking up their tokens. \n\nLinSpirit is primarily designed as a way to drive additional value to xLQDR to boost yields on Liquid Driver. \n\nIn short, winSpirit tokens let users enjoy inSPIRIT rewards (SpiritSwap's protocol fees) while retaining their ability to exit their positions. Since inSPIRIT is non-transferable and requires a lengthy lock of SPIRIT tokens, users are discouraged from minting inSPIRIT. winSPIRIT forks solve this by wrapping inSPIRIT and incentivizing deep liquidity for their winSPIRIT — SPIRIT pair.",
	"token.all.sinspirit.desc": "One of the winSpirit tokens, sinSpirit, issued by Scarab Finance, is a locked wrapper for veSpirit that allows users to enjoy the rewards of Spirit Finance without locking up their tokens. \n\nSinSpirit is primarily designed as a way to drive additional value to SCARAB to keep its price pegged to FTM. \n\nIn short, winSpirit tokens let users enjoy inSPIRIT rewards (SpiritSwap's protocol fees) while retaining their ability to exit their positions. Since inSPIRIT is non-transferable and requires a lengthy lock of SPIRIT tokens, users are discouraged from minting inSPIRIT. winSPIRIT forks solve this by wrapping inSPIRIT and incentivizing deep liquidity for their winSPIRIT — SPIRIT pair.",
	"token.all.binspirit.desc": "One of the winSpirit tokens, binSpirit, issued by Beefy Finance, is a locked wrapper for veSpirit that allows users to enjoy the rewards of Spirit Finance without locking up their tokens. \n\nThe SPIRIT used to mint binSPIRIT is locked for inSPIRIT. Beefy uses this inSPIRIT to boost all Beefy SpiritSwap vaults and vote for incentive emissions. \n\nIn short, winSpirit tokens let users enjoy inSPIRIT rewards (SpiritSwap's protocol fees) while retaining their ability to exit their positions. Since inSPIRIT is non-transferable and requires a lengthy lock of SPIRIT tokens, users are discouraged from minting inSPIRIT. winSPIRIT forks solve this by wrapping inSPIRIT and incentivizing deep liquidity for their winSPIRIT — SPIRIT pair.",
	"token.all.bomb.desc": "Bomb is a self-destructing currency. BOMB is a social experiment and financial case study to measure the feasibility of a deflationary currency.  The rules are simple. \n\n1) There were originally 1,000,000 Bomb in existence. \n2) Each time a Bomb is transferred, 1% of the transaction is destroyed. \n3) There will never be newly minted Bomb. \n\nThe intention is not to be used as a transactional currency, but rather a consistent and decentralized store of value.",
	"token.all.xtarot.desc": "xTAROT is staked TAROT which earns a share of the protocol's revenues. \n\nTarot is a decentralized lending protocol on Fantom Opera where users can participate as lenders or borrowers in isolated lending pools. Lenders can supply tokens to any lending pool in the Tarot Protocol to earn passive yield without impermanent loss, while borrowers can deposit LP tokens in a lending pool to borrow additional tokens in the token pair. \n\nThis enables borrowers to leverage their LP tokens for even more LP tokens, allowing for leveraged yield farming and enhanced liquidity providing rewards. The TAROT token can be staked for xTAROT to earn a share of protocol revenues.",
	"token.all.beftm.desc": "beFTM is short for Beefy Escrowed Fantom. beFTM gives stakers access to maximized Validator Node rewards that typically aren't available to the individual investor without locking FTM for 1 year. The token is loosely pegged to and 1:1 backed by FTM and can be staked on the Beefy platform and in farms on major DEXes. \n\nTo get your hands on beFTM, users must first deposit their FTM in the Beefy Delegator Vault. beFTM is then minted 1:1 with the FTM deposited or the FTM is used to buy beFTM from a liquidity pool depending on which is most profitable for the user. beFTM can also be purchased on many DEXes such as Solidly, BeethovenX, SpiritSwap, and SpookySwap. \n\nAfter depositing FTM to get beFTM, the FTM gets delegated to Beefy's Validator Node which earns more WFTM at around 14.5% APY. The WFTM rewards will be collected and distributed daily to the beFTM Earnings Pool where users can stake beFTM to earn WFTM. The beFTM Vault deposits the beFTM in the Earnings Pool and uses the share of the vault to buyback beFTM with the WFTM rewards. By doing so, the beFTM vault adds a continuous buying pressure to the beFTM token price. \n\nbeFTM can be: \nDeposited in the beFTM Vault for compounded interest in the form of more beFTM. \nDeposited in the WFTM Earnings Pool for simple interest with WFTM rewards. \nStaked in beFTM-FTM liquidity pools on all the major DEXes on Fantom. \n\nThere are several mechanisms in place to help beFTM maintain peg against FTM. First of all, Beefy's Smart Minter will not issue new beFTM tokens when the price of beFTM is below the price of FTM, it will instead buy beFTM from a liquidity pool helping to restore the peg and giving the user a more profitable option. Secondly, the beFTM vault adds a continuous buying pressure to the beFTM token price. Lastly, arbitrageurs will either buy and sell beFTM depending on the peg. \n\nIn a hypothetical situation where the peg crashes to 0 with no signs of recovery, Beefy's Validator Node can be paused, forfeiting all pending rewards, and after waiting 1 full week everyone will be able to redeem their beFTM for the delegated FTM.",
	"token.all.tonic.desc": "The Tectonic protocol is governed by the Tectonic token, TONIC. TONIC has a total supply of 500,000,000,000,000 TONIC (500 Trillion), it can be earned by participating in the Tectonic protocol activities. \n\nSimilar to Compound and AAVE, Tectonic is a decentralised non-custodial algorithmic-based money market protocol that allows users to participate as liquidity suppliers or borrowers. Suppliers provide liquidity to the market to earn a passive income, while borrowers are able to borrow liquidity in an over-collateralized fashion. \n\nTectonic's protocol design and architecture references Compound, a proven and audited protocol. It is complemented with an attractive incentive program powered by $TONIC, the native token of Tectonic protocol. \n\nIn summary, Tectonic protocol aims to provide secure & seamless cryptocurrencies money market functionalities, enabling multiple use cases for its users. \n\n1. “HODLers” can generate additional returns from interest by supplying assets to the protocol without having to actively manage their assets \nTraders can borrow certain cryptocurrencies to capitalize their short-term trading view (e.g., shorting) or yield maximizing opportunities (e.g., farming) \nUsers can obtain access to other cryptocurrencies for multiple purposes (e.g., participate in ICO, bonding), without having to liquidate their original assets",
	"token.all.stg.desc": "STG is the native utility and governance token of Stargate and can be used for staking, liquidity provision, and participating in protocol governance. Token holders can stake their STG to receive Stargate’s voting escrow token, veSTG. The protocol uses a time-weighted reward system that boosts the amount of veSTG that stakers receive the longer they keep it locked. This design keeps circulating supply pressure down and also helps align users that are interested in the long-term success of the protocol. \n\nStargate is a fully composable cross-chain bridge protocol built on LayerZero that enables native asset transfers between different blockchain networks. A major shortcoming of most current bridges is that they are unable to send native assets from one chain to another. Instead, they rely on the use of a wrapped or “intermediate” token to complete the bridging process. The problem with this approach is that it is extremely inefficient and makes the user experience onerous. Stargate is designed specifically to remove the need for wrapped tokens and lets users send native tokens directly to non-native chains. The protocol is built around unified liquidity pools shared between chains that ensure instant guaranteed finality. Stargate’s goal is to make cross-chain bridging a seamless and single transaction process. \n\nWith traditional web3 bridges, developers face three signification issues: They must make a compromise between native asset transaction requirements, instant guaranteed finality, and unified liquidity. Most bridge designs favor sacrificing the use of native assets and instead utilize a wrapped token to replace the native token. The end result is typically a Lock-and-Mint or Burn-and-Redeem mechanism. In general, the way these approaches work is by requiring the user to deposit the native asset of their source chain into the bridge’s smart contract, at which time the bridge then mints a wrapped version of the asset (e.g. $ETH → $WETH) on the destination chain. This achieves instant guaranteed finality since assets are minted 1:1 on the destination chain. It also removes the risk of reversion due to lack of liquidity. Yet a critical issue with this method is that once a wrapped token is minted on the destination chain, the user must then manually convert it into a native asset on the destination chain. Otherwise, they cannot use it; it merely serves as a vessel to complete the bridge. \n\nAnother issue is around liquidity and scaling. Bridges can only function properly if both the source chain and the destination chain have sufficient liquidity. So each time a new blockchain is integrated into a bridge protocol, the bridge must also bootstrap liquidity between each existing blockchain currently integrated. This places significant limitations on a bridge infrastructure’s ability to quickly scale and adopt new networks. \n\nTo solve the Bridging Trilemma, Stargate has developed a novel cross-chain bridge mechanism, ∆Bridge, and balancing algorithm, the Delta (∆) algorithm. Paired together, they enable cross-chain liquidity and purely native token transfers. ∆Bridges let users send native assets directly and seamlessly between different blockchains, without the need for an intermediate token and without any deprecation of interoperability or composability. ∆Bridges are powered by a unified liquidity pool shared amongst chains to ensure that each side of the bridge has sufficient liquidity, prevent transaction reversion, and achieve instantly guaranteed finality. Stargate’s ∆algorithm can be thought of as the backbone here as it supports ∆Bridges by automatically rebalancing liquidity pools. This design lets the ∆Bridge framework integrate numerous blockchain networks and scale more quickly and efficiently than most alternative. \n\nAll of this is in part achievable because of LayerZero’s infrastructure, which is an omnichain communication protocol that provides robust inter-chain communication between large blockchain networks. This foundation enables Stargate to effectively communicate bidirectionally between source and destination chains, and ultimately makes it possible to bridge native assets while preserving instant guaranteed finality and unified liquidity.",
	"token.all.cow.desc": "The COW token is the governance token of the Cowswap protocol. Community members will be able to participate in governane by staking the COW token. The cap of Cowswap tokens is fixed. The team will reserve 50% of the transaction fee to the project treasury, and regularly repurchase part of the tokens at market prices for destruction; this keeps Cowswap tokens deflationary to increase the value of the tokens. \n\nCoW Protocol is a fully permissionless trading protocol that leverages Batch Auctions as its price finding mechanism. CoW protocol enables batch auctions to maximize liquidity via Coincidence of Wants (CoWs) in addition to tapping all available on-chain liquidity whenever needed. Batch Auctions are continuously run by the protocol because the solvers, the parties in charge of finding the most optimal settlement for the batch, are in competition to settle it. The winning solver will be the one that can maximize traders surplus by either having the most optimal CoW, finding the best liquidity sources, or combining both in a single settlement. \n\nCoincidence of Wants (CoWs) are one of the most, if not the most, innovative aspects of the protocol, but what exactly are they? CoWs are settlements which share liquidity across all orders who have matching limit prices. Rather than an AMM or an CLOB, CoW protocol uses batch auctions as a core mechanism to facilitate CoWs. Using batch auctions leads to better prices for the individual traders as well as offering big savings, in terms of gas fees optimization and liquidity provider fees. Additionally, because of Batch Auction uniform clearing prices and CoWs not needing access to on-chain liquidity, CoW protocol is able to offer the user a level of MEV protection that can not be achieved by any other protocol.",
	"token.all.cadc.desc": "CADC is a stablecoin pegged to the Canadian Dollar. Every CADC is fully backed by a reserve of real CAD in a bank account, and redeemable on a 1-to-1 basis for Canadian dollars. The CADC smart contract code is forked from Circle's USDC design, implementing a battle-tested standard for maximum composability on Ethereum. Each CADC is issued by PAYTRIE AB Inc., a fully licensed Money Services Business (M19690633) regulated by FINTRAC, Canada's financial intelligence unit. You can buy and sell CADC with Interac e-transfers directly on PayTrie with 24/7 access.",
	"token.all.doge.desc": "Dogecoin, or DOGE, is a cryptocurrency created by software engineers Billy Markus and Jackson Palmer, who decided to create a payment system as a joke, making fun of the wild speculation in cryptocurrencies at the time. A modified fork of Bitcoin, it is considered both the first meme coin, and, more specifically, the first dog. Despite its satirical nature, some consider it a legitimate investment prospect. Dogecoin features the face of the Shiba Inu dog from the Doge meme as its logo and namesake. It was introduced on December 6, 2013, and quickly developed its own online community, reaching a market capitalization of over $85 billion on May 5, 2021. \n\nDogecoin started with a supply limit of 100 billion coins, which would have been far more coins than the top digital currencies were then allowing. By mid-2015 the 100 billionth Dogecoin had been mined with an additional 5 billion coins put into circulation every year thereafter. Although there is no theoretical supply limit, at this rate, the number of Dogecoins put into circulation will only double in 20 years (the next doubling will occur in the year 2075). There is no implemented hard cap on the total supply of Dogecoins. Nonetheless, in February 2014, Dogecoin founder Jackson Palmer announced that the limit would be removed in an effort to create a consistent reduction of its inflation rate over time. In other words, the inflation rate improves over time starting at 5% in 2015 to less than 4% by 2019, 3% by 2027, and 2% by 2035. \n\nElon Musk frequently uses his Twitter platform to express his views on Dogecoin, which has led some to claim that his actions amount to market manipulation because the price of Dogecoin frequently experiences price movements shortly after Dogecoin-related tweets released by Elon Musk. Nevertheless, because cryptocurrencies are not regulated like stocks, these actions are not illegal. Musk and his promotion of Dogecoin have been criticized by Dogecoin co-founder Jackson Palmer, who called Musk a 'self-absorbed grifter'. \n\nMusk's first Dogecoin-related tweet occurred on December 20, 2020. Musk tweeted 'One Word: Doge'. Shortly after, the value of Dogecoin rose by 20%. This was followed by a series of Dogecoin-related tweets by Musk in early February 2021 captioned 'Dogecoin is the people's crypto' and 'no highs, no lows, only Doge'. Following these tweets, the value of Dogecoin rose by roughly 40%. On April 15, 2021, the price of Dogecoin rose by more than 100% after Musk tweeted an image of Joan Miró's 'Dog Barking at the Moon' painting captioned 'Doge Barking at the Moon'. The price of Dogecoin rose by 11% on May 20, 2021, shortly after Musk tweeted a Doge-related meme. In May 2021, the price of Dogecoin was up 10% in the hours after Musk tweeted a Reddit link for users to submit proposals to improve the cryptocurrency. On December 14, 2021, Dogecoin spiked more than 20% after Elon Musk said that Tesla will accept the currency as a means of payment for Tesla merchandise.",
	"token.all.mai.desc": "Similar to MakerDAO's Dai, miMatic, or MAI, is a stablecoin backed by locked collateral tokens. MAI borrowing is decentralized and non-custodial, meaning that only users have control over their funds. \n\nMAI can only be made through locking collateral to back its value - either through approved collateral in vaults or through Anchor. Collateral can be static tokens like LINK, CRV, and others. It can also be exotic assets like Beefy and Yearn strategies. Interest-bearing collateral like Beefy, Yearn, and Aave receipt tokens allow users to accumulate yield from their collateral while it's deposited in MAI vaults. \n\nTo make MAI through vaults, users can deposit collateral in their vaults and mint MAI against it. You will not be charged interest for minting MAI through vaults. This means you can hold MAI debt long term without accruing costs.",
	"token.all.atom.desc": "ATOM is the native token of Cosmos, a decentralized network that provides open-source tools for developers to create their own interoperable blockchains. One of the biggest problems with blockchains is they are created independently and very few have the ability to transfer data between one another. Cosmos is looking to become the “internet for blockchains,” allowing blockchains to freely share data and tokens across all the blockchains that are in the Cosmos ecosystem. \n\nWith Cosmos, developers can choose to build entirely autonomous application-specific blockchains that can easily interconnect. This means that, unlike with other leading blockchains today, they are no longer forced to exist as smart contracts on someone else's chain. They can opt-out of high transaction fees and network congestion, make their own rules, and scale for mainstream adoption. This has massive implications for the future of decentralized finance (DeFi), non-fungible tokens (NFTs), gaming, autonomous organizations, social networks, marketplaces, and the sustainable growth of blockchain technology, the internet of value, and the ownership economy in which everyone has a stake. Instead of one million blockchain apps competing for throughput on a single base layer, why not one million blockchain apps interconnected across one million sovereign blockchains? This is what’s possible with Cosmos.",
	"token.all.single.desc": "SINGLE is the limited supply governance token for the Single Finance Protocol. SINGLE token holders are able to participate in governance and shape the future of SINGLE, as well as determine key parameters for the interest rate model, fee rates, and the distribution of protocol fees and reserves accrued to the Single Finance Protocol. SINGLE token holders can participate in protocol governance by staking SINGLE for xSINGLE in the future. The total supply of SINGLE is 1,000,000,000. \n\nSINGLE tokens are long-term deflationary. Emissions will last for approximately 36 months, with halvenings occurring every six months. A halvening means the budget for maximum tokens used for emissions during a 6 month period will halve relative to the previous period. The full amount of the budget will not necessarily be emitted during that period. \n\nSingle Finance is a super intuitive platform to all your DeFi investments minimizing correlations to the general market. Everything here is worked out from your injected capital in USD. Everything is visualized. And everything is within your fingertips. Single helps keep your leveraged yield farming positions safe and stable by protecting your principal with their strategies. They track your performance based on your principal marked to USD, ensuring that all involved parties know your profits well. Single Finance is also the first to introduce a historical performance tracking database to help you pick your favourite liquidity pairs with quantitative metrics. Futher, they charge performance fees only when you are making money, again, based upon your principal in USD.",
	"token.all.byte.desc": "BYTE is the native token of BinaryDAO for yield rewards and governance. The BYTE token doesn’t have a max supply. You can earn BYTE through staking, or you can buy BYTE through the mint function. Roughly 15% of all BYTE will go towards development to ensure rapid innovation. \n\nBinaryDAO is a new DeFi primitive that helps users gain exposure in DeFi yield and deals through its native BYTE token, and create exponential value and unmatched upside for BYTE token holders. It achieves this by putting its treasury to work and generate return through liquidity providing, partnering and investing in early-stage projects: opportunities that are typically not available to the average investor. \n\nBYTE is a yield DAO. The protocol grows their treasury by investing and providing liquidity in the Metis ecosystem and they also offer users the ability to mint BYTE tokens by locking up stablecoins. By staking BYTE, you gain access to the yield generation that their team is constantly optimising and managing. They have a long-term vision and partnership with Metis and will continue to be a core element of and contributor to the ecosystem for years to come. Due to the profit sharing model they have created and the power of compounding interest, the longer users stake in our protocol, the more exponential returns they will receive.",
	"token.all.hera.desc": "HERA is a governance token of Hera dex aggregator protocol. That's aimed to use the project within the existing and new features of Hera Finance. HERA has 3 primary uses: voting & governance, staking & farming incentives, and swap fee discounts. \n\nHera aims to be key liquidity aggregator for Metis Network, offering the widest range of tokens and best route discovery between any token pair. We aim to provide the most friendly UX for users and most powerful tools for developers to allow them to easily access the best-in-class swap in their application, interface or on-chain programs. \n\nThe price for a token can change quickly at any point in time.  So the best priced trade is not always on one DEX and may involve a combination of trades across many DEXes. Here are some key features for how Hera dex aggregator discovers the best priced trades: \n\nSmart Routing - Hera directly connects all DEX markets and AMM pools together no matter the provider and will find all direct and 2-hop to 5-hop routes between any two tokens on Metis Network. Not only does Hera dex aggregator compare the prices between markets on different DEXes but often the best priced routes are not direct markets. Instead, Hera.Finance may finds the best price by routing through an intermediary token, e.g. USDC-WETH-METIS instead of USDC-METIS. This may be due to price inefficiencies and/or volatility in the various markets that Hera.Finance routes through. \n\nTrade Splitting - Hera dex aggregator will split your trade into smaller trade sizes.  For example, if you want to make a 100 USDC-METIS trade, it may distribute your trade into a 30 USDC-METIS trade on Netswap and a 70 USDC-METIS trade on Tethys Finance.  The % distribution of the trades is dynamically determined to give you the best price. Trade splitting helps get better prices for large size trades and  trades with tokens where there is shallow liquidity spread out across a number of DEXes.",
	"token.all.steth.desc": "stETH is a token that represents staked ether in Lido, combining the value of initial deposit + staking rewards. stETH tokens are minted upon deposit and burned when redeemed. stETH token balances are pegged 1:1 to the ethers that are staked by Lido. stETH token's balances are updated when the oracle reports change in total stake every day. stETH tokens can be used as one would use ether, allowing you to earn ETH 2.0 staking rewards whilst benefiting from e.g. yields across decentralised finance products.",
	"token.all.daik.desc": "DAIK is a wrapped version of DAI. It is maintained by the OKEX exchange and primarily used on the OKEX chain.",
	"token.all.1eth.desc": "1ETH is a wrapper version of ETH. It is maintained by the Harmony ONE team and primarily used on the Harmony chain.",
	"token.all.1dai.desc": "1DAI is a wrapper version of DAI. It is maintained by the Harmony ONE team and primarily used on the Harmony chain.",
	"token.all.1wbtc.desc": "1WBTC is a wrapper version of WBTC. It is maintained by the Harmony ONE team and primarily used on the Harmony chain.",
	"token.all.eth-2.desc": "WETH or 'wrapped ether' is Ethereum that has been converted to an ERC-20 token to faciliate development and composability with other ERC-20 tokens/protocols",
	"token.all.wone.desc": "Similar to ETH and wETH, wONE is a wrapped version the native token for the Harmony ONE chain that can be used more fluidly for composability.",
	"token.all.oxdv1.desc": "Similar to Solidex, 0XD is the token for 0xDAO. This DAO is a platform built on top of Andre Cronje's Solidly protocol designed to control large amounts of SOLID through the DAO.",
	"token.all.oxsolid.desc": "oxSOLID is SOLID that has been permanently converted to oxSOLID via the OXDAO platform. Similar to cvxCRV, oxSOLID is non-redeemable and may lose its peg with SOLID. Users are able to stake oxSOLID to earn a share of platform fees and other rewards on OXDAO.",
	"token.all.weve.desc": "WEVE is the governance token for veDAO. Similar to Solidex and OXDAO, WEVE is a community run DAO that sprung up in the days before Andre Cronje's Solidly launch in order to accumulate enough TVL to be eligibile for receiving the notorious airdrop. After the community passed VIP-5, veDAO entered a partnership with Solidex to help them manage their Solidly veNFT.",
	"token.all.pgunk.desc": "PGUNK is used for community votes and a portion of the supply will be distributed as rewards for playing Fantomon. \n\nFantomon is a Play-to-Earn Trading Card Game that merges a retro game style with DeFi and a Play-to-Earn model. The entire game is built on-chain on the Fantom Opera network. All cards, items and resources are tokens on Fantom! Fantomons are bizarre creatures from another realm that have started appearing in our universe through some form of 'gateway'! We don't know how or why they are here, nor do we understand where they came from. Trainers collect and study Fantomons to improve our understanding of them, maintain the delicate balance and prevent catastrophe. Collect Trainer cards and Fantomon cards, interact with them, and unlock new ways to earn!",
	"token.all.fbeets.desc": "fBEETS is the staked version of the BeethovenX protocol token, BEETS. In addition to governance rights, fBEETS holders receive platform frees from BeethovenX. \n\n30% of the fees collected through trade and flash loan protocol fees will be used to buy BEETS off the open market and redistribute them to fBEETS holders. 50% of protocol fees will be used to build a diversified DAO controlled LP treasury that will act as a solid tailwind for future growth.  The remaining 20% will be kept by the team to fund continued development and infrastructure costs. \n\n Additionally, 2% of the team funds will be diverted to secure that Beethoven X remain a positive contribution to the environment, directly removing all their Green House Gas Emissions Scope, 1, 2, 3 and invest in regenerative capturing solutions such as forestry, regenerative agriculture or direct air capturing.",
	"token.all.ape.desc": "From the creators of Bored Ape Yatch Club, ApeCoin is the governance token for Yuga Labs' APE Foundation. \n\nThe Foundation facilitates decentralized and community-led governance and is designed to become more decentralized over time. It is tasked with administering the decisions of the ApeCoin DAO, and is responsible for day-to-day administration, bookkeeping, project management, and other tasks that ensure the DAO community's ideas have the support they need to become a reality. \n\nThe goal of the APE Foundation is to steward the growth and development of the APE ecosystem in a fair and inclusive way. It utilizes the Ecosystem Fund, which is controlled by a multisig wallet, to pay its expenses as directed by the ApeCoin DAO and provides an infrastructure for ApeCoin holders to collaborate through open and permissionless governance processes."
}